import React, { useEffect, useState } from 'react';

import data from '../db.json'

function All(){
   
const [data1, setData] = useState(null);

useEffect(() => {
  // Загрузка данных из JSON-файла
  fetch(data)
    .then(response => response.json())
    .then(jsonData => setData(jsonData))
    .catch(error => console.error('Ошибка загрузки данных:', error));
    console.log(data1);
}, []);

   
  return (
    <>
   {data1.name}
  <meta httpEquiv="Content-Type" content="text/html; charset=UTF-8" />
  <meta httpEquiv="X-UA-Compatible" content="IE=edge" />
  <meta
    name="viewport"
    content="width=device-width, initial-scale=1.0, user-scalable=no"
  />
  <meta name="format-detection" content="telephone=no" />

  <meta name="msapplication-config" content="/img/browserconfig.xml" />
  <meta name="theme-color" content="#ffffff" />
  <meta
    property="og:title"
    content="Актуальные промокоды скидки купоны акции 2023 — самые выгодные скидки и промокоды!"
  />

  <meta name="og:url" content="https://promo.getblogger.ru/promo" />
  <meta
    name="og:image"
    content="https://promo.getblogger.ru/files/logo/logo_3fca28708d6747d60f1d72dcb370803d.jpg"
  />
  <meta name="csrf-param" content="_csrf-promo" />
  <meta
    name="csrf-token"
    content="7PjTqWUkoa5BNu42_iEvh8RkGlhdC3hg0s6-krEtPo6vsv7gOmPP_jsE12aMT12_lyF2MQhGCCujuOb_009v_w=="
  />
  
  <div style={{ width: 0, height: 0, overflow: "hidden" }} />
  <div style={{ width: 0, height: 0, overflow: "hidden" }}>
    <svg xmlns="http://www.w3.org/2000/svg">
      <defs>
        <clipPath id="close-a">
          <path fill="#fff" d="M0 0h24v24H0z" />
        </clipPath>
        <linearGradient
          id="social-instagram-a"
          x1={2}
          y1={12}
          x2="22.001"
          y2={12}
          gradientUnits="userSpaceOnUse"
        >
          <stop stopColor="#F6B761" />
          <stop offset=".486" stopColor="#FC3A77" />
          <stop offset={1} stopColor="#555BC3" />
        </linearGradient>
        <linearGradient
          id="social-telegram-a"
          x1="2.001"
          y1={12}
          x2="22.002"
          y2={12}
          gradientUnits="userSpaceOnUse"
        >
          <stop stopColor="#F6B761" />
          <stop offset=".486" stopColor="#FC3A77" />
          <stop offset={1} stopColor="#555BC3" />
        </linearGradient>
        <clipPath id="social-twitter-a">
          <path
            fill="#fff"
            transform="translate(.003 .001)"
            d="M0 0h24v24H0z"
          />
        </clipPath>
        <linearGradient
          id="social-vk-a"
          x1="2.002"
          y1="11.999"
          x2="22.003"
          y2="11.999"
          gradientUnits="userSpaceOnUse"
        >
          <stop stopColor="#F6B761" />
          <stop offset=".486" stopColor="#FC3A77" />
          <stop offset={1} stopColor="#555BC3" />
        </linearGradient>
        <linearGradient
          id="social-website-a"
          x1=".755"
          y1="2.001"
          x2="24.088"
          y2="22.001"
          gradientUnits="userSpaceOnUse"
        >
          <stop stopColor="#00FFC2" />
          <stop offset={0} stopColor="#00FFC2" />
          <stop offset={1} stopColor="#0094FF" />
        </linearGradient>
        <linearGradient
          id="social-youtube-a"
          x1="2.005"
          y1="12.001"
          x2="22.005"
          y2="12.001"
          gradientUnits="userSpaceOnUse"
        >
          <stop stopColor="#F6B761" />
          <stop offset=".486" stopColor="#FC3A77" />
          <stop offset={1} stopColor="#555BC3" />
        </linearGradient>
      </defs>
      <symbol id="icon-close-search" viewBox="0 0 8 14">
        <path
          d="M2.828 7l4.95 4.95-1.414 1.414L0 7 6.364.636 7.778 2.05z"
          fillRule="nonzero"
        />
      </symbol>
      <symbol id="icon-close" viewBox="0 0 24 24">
        <g clipPath="url(#close-a)">
          <path d="M12 10.586l4.95-4.95 1.414 1.414-4.95 4.95 4.95 4.95-1.414 1.414-4.95-4.95-4.95 4.95-1.414-1.414 4.95-4.95-4.95-4.95L7.05 5.636l4.95 4.95z" />
        </g>
      </symbol>
      <symbol id="icon-copy-promocode" viewBox="0 0 18 20">
        <path
          d="M4 4V1a1 1 0 0 1 1-1h12a1 1 0 0 1 1 1v14a1 1 0 0 1-1 1h-3v3c0 .552-.45 1-1.007 1H1.007A1.003 1.003 0 0 1 0 19L.003 5c0-.552.45-1 1.007-1H4zM2.003 6L2 18h10V6H2.003zM6 4h8v10h2V2H6v2z"
          fillRule="nonzero"
        />
      </symbol>
      <symbol id="icon-filter" viewBox="0 0 18 12">
        <path
          d="M7 12h4v-2H7v2zM0 0v2h18V0H0zm3 7h12V5H3v2z"
          fillRule="nonzero"
        />
      </symbol>
      <symbol id="icon-filters-not-found" viewBox="0 0 130 130">
        <path d="M99 37.845v-19.39a2.712 2.712 0 0 0-2.847-2.442H13.847A2.584 2.584 0 0 0 11 18.455v19.39a3.2 3.2 0 0 0 .776 1.8l31.577 31.738v43.047a2.695 2.695 0 0 0 1.294 2.184c.38.26.833.395 1.294.386l1.165-.257 18.117-8.995a2.696 2.696 0 0 0 1.424-2.313V71.383l31.577-31.739A3.2 3.2 0 0 0 99 37.845zM62.117 68.556a3.07 3.07 0 0 0-.646 1.799v33.538l-12.942 6.296V70.355a2.561 2.561 0 0 0-.776-1.799l-28.47-28.783h71.435l-28.6 28.783zm31.706-33.923H16.176v-13.48h77.647v13.48z" />
        <path d="M112.443 67.653a16.87 16.87 0 0 0-.284-.284c-8.775-8.602-22.875-8.475-31.494.284-.095.093-.19.188-.284.283-8.618 8.759-8.49 22.832.284 31.434a22.035 22.035 0 0 0 15.89 6.63 22.557 22.557 0 0 0 15.803-6.544c8.822-8.759 8.861-22.998.085-31.803zm-3.646 28.077c-6.668 6.255-17.058 6.255-23.726 0-6.97-6.539-7.31-17.48-.76-24.437 6.764-6.744 17.722-6.744 24.485 0 6.617 6.807 6.617 17.63.001 24.437z" />
        <path d="M104.854 75.182a2.412 2.412 0 0 0-3.529 0l-4.762 4.825-4.888-4.825a2.411 2.411 0 0 0-3.529 0 2.601 2.601 0 0 0 0 3.619l4.762 4.7-4.762 4.699a2.601 2.601 0 0 0 0 3.618 2.412 2.412 0 0 0 3.53 0l4.887-4.824 4.762 4.824c.465.47 1.099.739 1.764.749a2.282 2.282 0 0 0 1.765-.75 2.602 2.602 0 0 0 0-3.617l-4.762-4.7 4.762-4.7a2.602 2.602 0 0 0 0-3.618z" />
      </symbol>
      <symbol id="icon-search-big" viewBox="0 0 130 130">
        <path d="M67.109 24.976a2.708 2.708 0 1 1-3.83 3.83c-9.506-9.505-24.968-9.505-34.473 0a2.708 2.708 0 1 1-3.83-3.83c11.615-11.616 30.517-11.616 42.133 0zm54.766 86.066a10.75 10.75 0 0 1-3.174 7.659 10.754 10.754 0 0 1-7.659 3.174 10.754 10.754 0 0 1-7.659-3.174L74.945 90.263a2.708 2.708 0 0 1 0-3.83l3.83-3.829-6.006-6.005c-7.15 6.26-16.499 10.068-26.727 10.068-22.4 0-40.625-18.225-40.625-40.625S23.641 5.417 46.042 5.417c22.4 0 40.625 18.224 40.625 40.625 0 10.228-3.808 19.577-10.068 26.727l6.005 6.006 3.83-3.83a2.708 2.708 0 0 1 3.83 0l28.437 28.438a10.748 10.748 0 0 1 3.174 7.659zm-40.625-65c0-19.414-15.793-35.209-35.208-35.209S10.834 26.628 10.834 46.042c0 19.413 15.793 35.208 35.208 35.208S81.25 65.455 81.25 46.042zm35.209 65a5.385 5.385 0 0 0-1.587-3.83L88.349 80.689l-7.66 7.66 26.523 26.522c2.048 2.048 5.613 2.048 7.66 0a5.38 5.38 0 0 0 1.587-3.829z" />
      </symbol>
      <symbol id="icon-search" viewBox="0 0 21 21">
        <path
          d="M16.031 14.617l4.283 4.282-1.415 1.415-4.282-4.283A8.96 8.96 0 0 1 9 18c-4.968 0-9-4.032-9-9s4.032-9 9-9 9 4.032 9 9a8.96 8.96 0 0 1-1.969 5.617zm-2.006-.742A6.977 6.977 0 0 0 16 9c0-3.868-3.133-7-7-7-3.868 0-7 3.132-7 7 0 3.867 3.132 7 7 7a6.977 6.977 0 0 0 4.875-1.975l.15-.15z"
          fillRule="nonzero"
        />
      </symbol>
      <symbol id="icon-social-facebook" viewBox="0 0 24 24">
        <path
          d="M2 12.001c0-5.523 4.477-10 10-10s10 4.477 10 10-4.477 10-10 10-10-4.477-10-10z"
          fill="#fff"
        />
        <path
          d="M12 2.001c-5.523 0-10 4.477-10 10 0 4.991 3.657 9.128 8.438 9.88v-6.99h-2.54v-2.89h2.54V9.798c0-2.506 1.492-3.89 3.777-3.89 1.094 0 2.238.195 2.238.195v2.46h-1.26c-1.243 0-1.63.771-1.63 1.562v1.876h2.773l-.443 2.89h-2.33v6.99C18.343 21.13 22 16.99 22 12c0-5.523-4.477-10-10-10z"
          fill="#1F74EF"
        />
      </symbol>
      <symbol id="icon-social-instagram" viewBox="0 0 24 24">
        <path d="M4.803 4.8h14.4v14.4h-14.4V4.8z" fill="#fff" />
        <path
          d="M12 2c2.718 0 3.057.01 4.123.06 1.065.05 1.79.216 2.428.464.66.254 1.216.598 1.772 1.153a4.91 4.91 0 0 1 1.153 1.772c.247.637.415 1.363.465 2.429.047 1.066.06 1.405.06 4.122 0 2.717-.01 3.056-.06 4.122-.05 1.065-.218 1.79-.465 2.428a4.884 4.884 0 0 1-1.153 1.772c-.5.508-1.105.902-1.772 1.153-.637.247-1.363.415-2.428.465-1.066.047-1.405.06-4.123.06-2.717 0-3.056-.01-4.122-.06-1.065-.05-1.79-.218-2.428-.465a4.89 4.89 0 0 1-1.772-1.153 4.905 4.905 0 0 1-1.153-1.772c-.248-.637-.415-1.363-.465-2.428C2.013 15.056 2 14.717 2 12c0-2.717.01-3.056.06-4.122.05-1.067.217-1.79.465-2.429a4.88 4.88 0 0 1 1.153-1.772A4.897 4.897 0 0 1 5.45 2.524c.638-.248 1.362-.415 2.428-.465C8.944 2.012 9.283 2 12 2zm0 5a5 5 0 1 0 0 10 5 5 0 0 0 0-10zm6.5-.25a1.25 1.25 0 1 0-2.5 0 1.25 1.25 0 0 0 2.5 0zM12 9a3 3 0 1 1 0 6 3 3 0 0 1 0-6z"
          fill="url(#social-instagram-a)"
        />
      </symbol>
      <symbol id="icon-social-likee" viewBox="0 0 25 24">
        <path
          d="M18.634 5.351c1.201.561 2.09 1.434 2.643 2.642-.04.035-.083.068-.122.106l-5.46 5.43c-1.657 1.65-3.314 3.3-4.967 4.953-.447.447-1.348 1.4-1.348 1.4l-.116-.117-.297-.297-.225-.224-.311-.31-.203-.19-1.506-1.503.058-.041 2.13-2.136c.837-.838 1.672-1.678 2.511-2.514.836-.832 1.677-1.659 2.513-2.49.792-.788 1.582-1.578 2.37-2.368.778-.78 1.554-1.56 2.33-2.341z"
          fill="#E1774D"
        />
        <path
          d="M9.38 19.883s.902-.954 1.348-1.401c1.654-1.653 3.311-3.303 4.968-4.953l5.46-5.43c.038-.038.082-.071.122-.107.814 1.739.84 3.533-.231 5.09-.916 1.332-2.156 2.448-3.295 3.619-1.592 1.634-3.223 3.23-4.838 4.843l-.072.064a.034.034 0 0 0-.02.02l-.021.023a.035.035 0 0 0-.02.019l-.067.067c-.08.072-.154.151-.24.216-.338.294-.599.33-.986-.002-.249-.214-.481-.46-.724-.689l-.003-.002-.03-.032v-.001a17.483 17.483 0 0 1-.097-.096l-.035-.034-.324-.324a11.654 11.654 0 0 1-.036-.035l-.03-.03a4.138 4.138 0 0 0-.036-.035l-.029-.029-.1-.1-.03-.031-.002-.002-.26-.258-.1-.1-.03-.029-.067-.069-.174-.172z"
          fill="#EDBA13"
        />
        <path
          d="M18.635 5.35c-.777.781-1.552 1.562-2.33 2.342-.788.79-1.578 1.58-2.37 2.368-.836.831-1.677 1.658-2.513 2.49-.839.836-1.675 1.676-2.511 2.515L6.781 17.2l-.058.041s-1.699-1.726-2.544-2.576c.396-.417.781-.83 1.18-1.244.496-.516.996-1.028 1.494-1.54l.131-.133.098-.096.193-.175.057-.055.62-.623.956-.972.192-.195.167-.163 2.766-2.74c1.84-1.894 4.288-2.43 6.52-1.426.028.012.054.031.082.048z"
          fill="#D92D73"
        />
        <path
          d="M7.275 11.476l-.193.175-.098.096-.13.132-.13.129c-.158-.165-.375-.396-.537-.556-.993-.988-1.99-1.97-2.976-2.965-.162-.163-.272-.376-.405-.567.538-1.12 1.379-1.938 2.487-2.49.11.053.244.082.326.163a333.752 333.752 0 0 1 3.296 3.293c.155.158.335.318.466.464-.056.054-.225.227-.28.281l-.193.195-.956.971c-.206.209-.414.416-.62.624a4.23 4.23 0 0 1-.057.055z"
          fill="#A448F9"
        />
        <path
          d="M9.364 9.383a7.22 7.22 0 0 0-.45-.497 326.722 326.722 0 0 0-3.296-3.293c-.082-.08-.216-.11-.326-.162 1.952-1.124 4.757-.66 6.488 1.07.08.08.169.152.253.227-.922.914-1.747 1.741-2.67 2.655z"
          fill="#D64DD3"
        />
        <path
          d="M2.806 7.92c.133.19.243.404.404.567.986.995 1.984 1.977 2.977 2.964.161.161.536.556.536.556l-.18.196-1.467 1.516s-.505.538-.897.946c-1.996-1.791-2.42-4.84-1.373-6.745z"
          fill="#794EE7"
        />
      </symbol>
      <symbol id="icon-social-ok" viewBox="0 0 25 24">
        <path
          d="M14.138 16.47l.115.12 2.75 2.755c.529.53.625 1.305.24 1.906a1.498 1.498 0 0 1-2.32.267c-.919-.91-1.83-1.828-2.743-2.744-.036-.037-.063-.083-.104-.137-.059.055-.096.088-.132.124-.905.906-1.812 1.813-2.716 2.72-.349.351-.77.505-1.257.46a1.498 1.498 0 0 1-1.296-1.144 1.459 1.459 0 0 1 .408-1.426c.921-.93 1.85-1.854 2.774-2.781l.116-.121c-.114-.032-.206-.06-.3-.084a9.402 9.402 0 0 1-2.708-1.17 1.502 1.502 0 0 1 .08-2.6c.488-.265.997-.262 1.471.027.779.475 1.607.807 2.508.946a6.517 6.517 0 0 0 4.079-.67c.233-.12.451-.276.693-.375a1.49 1.49 0 0 1 2.052 1.414c-.01.554-.258.98-.725 1.272a9.72 9.72 0 0 1-2.861 1.203c-.034.008-.067.02-.124.038zM12.055 12.218c-2.79.03-5.17-2.27-5.165-5.172.005-2.792 2.238-5.164 5.17-5.162a5.152 5.152 0 0 1 5.16 5.197c-.014 2.911-2.407 5.167-5.165 5.137zm-.002-3.002a2.162 2.162 0 0 0 2.162-2.185c-.012-1.207-1.03-2.149-2.188-2.136-1.092.012-2.155.92-2.131 2.203a2.159 2.159 0 0 0 2.157 2.118z"
          fill="#F07D00"
        />
      </symbol>
      <symbol id="icon-social-rutube" viewBox="0 0 25 24">
        <path
          fillRule="evenodd"
          clipRule="evenodd"
          d="M4.004 17.484V6.22H15c1.61 0 2.95 1.246 2.95 2.95v1.61c0 1.877-1.34 2.95-2.145 2.95l2.414 3.755H15l-2.414-3.755h-5.9v3.755H4.003zm2.682-9.12v3.408h7.51s1.341 0 1.341-1.34v-.994c0-1.073-1.34-1.073-1.34-1.073h-7.51z"
          fill="#fff"
        />
        <circle cx="20.366" cy="4.879" r="1.878" fill="#EE233C" />
      </symbol>
      <symbol id="icon-social-telegram" viewBox="0 0 25 24">
        <path d="M6.003 6h12v12h-12V6z" fill="#fff" />
        <path
          d="M12.002 22c-5.524 0-10-4.477-10-10 0-5.524 4.476-10 10-10 5.523 0 10 4.476 10 10 0 5.523-4.477 10-10 10zm-3.11-8.83l.013-.007.87 2.87c.112.31.266.367.453.34.188-.024.287-.125.41-.243l1.188-1.148 2.55 1.888c.466.257.8.124.917-.432l1.657-7.822c.183-.728-.137-1.02-.702-.788l-9.734 3.76c-.664.266-.66.638-.12.803l2.498.78v-.001z"
          fill="#fff"
        />
        <path
          d="M12.002 22c-5.524 0-10-4.477-10-10 0-5.524 4.476-10 10-10 5.523 0 10 4.476 10 10 0 5.523-4.477 10-10 10zm-3.11-8.83l.013-.007.87 2.87c.112.31.266.367.453.34.188-.024.287-.125.41-.243l1.188-1.148 2.55 1.888c.466.257.8.124.917-.432l1.657-7.822c.183-.728-.137-1.02-.702-.788l-9.734 3.76c-.664.266-.66.638-.12.803l2.498.78v-.001z"
          fill="url(#social-telegram-a)"
        />
        <path
          d="M12.002 22c-5.524 0-10-4.477-10-10 0-5.524 4.476-10 10-10 5.523 0 10 4.476 10 10 0 5.523-4.477 10-10 10zm-3.11-8.83l.013-.007.87 2.87c.112.31.266.367.453.34.188-.024.287-.125.41-.243l1.188-1.148 2.55 1.888c.466.257.8.124.917-.432l1.657-7.822c.183-.728-.137-1.02-.702-.788l-9.734 3.76c-.664.266-.66.638-.12.803l2.498.78v-.001z"
          fill="#00ABDE"
        />
      </symbol>
      <symbol id="icon-social-tiktok" viewBox="0 0 25 24">
        <path
          d="M20.768 6.927c-1.538-1.557-2.05-.52-3.589-3.63C16.02.954 13.827.71 12.052 1.224c-1.503.435-3.076 1.557-3.076 4.149v1.555s-2.364.21-4.102 1.555c-2.26 1.75-2.563 3.63-2.563 3.63s-.7 2.074 0 4.665c.839 3.113 3.076 4.667 3.076 4.667s2.05 1.555 5.127 1.555c2.77 0 4.614-1.555 4.614-1.555s2.051-1.554 2.564-4.148c.314-1.588 0-4.148 0-4.148s1.966.37 3.076-.518c1.726-1.383 1.557-4.127 0-5.703z"
          fill="#fff"
        />
        <path
          d="M9.67 12.295c-1.272 0-2.3 1.028-2.281 2.287.012.809.457 1.51 1.112 1.902a2.214 2.214 0 0 1-.36-1.18c-.02-1.26 1.009-2.288 2.28-2.288.251 0 .493.04.718.113v-2.523a4.956 4.956 0 0 0-.717-.053h-.035v1.855a2.355 2.355 0 0 0-.717-.113zM15.169 4.731h-.671a3.853 3.853 0 0 0 1.457 2.322 3.88 3.88 0 0 1-.786-2.322z"
          fill="#F00044"
        />
        <path
          d="M19.004 8.569c-.247 0-.486-.025-.72-.069v1.808c-.853 0-1.68-.166-2.457-.498a6.416 6.416 0 0 1-1.397-.815l.012 5.574a4.663 4.663 0 0 1-1.397 3.315 4.753 4.753 0 0 1-2.657 1.329 4.956 4.956 0 0 1-.718.053 4.759 4.759 0 0 1-2.923-.99 4.775 4.775 0 0 0 3.678 1.71c.241 0 .483-.018.718-.053a4.754 4.754 0 0 0 2.657-1.328 4.663 4.663 0 0 0 1.397-3.315l-.047-5.574c.426.329.893.604 1.398.814.78.33 1.607.498 2.456.498"
          fill="#F00044"
        />
        <path
          d="M7.041 11.942a4.768 4.768 0 0 1 3.347-1.388v-.668a4.961 4.961 0 0 0-.718-.053 4.764 4.764 0 0 0-3.38 1.388 4.695 4.695 0 0 0-1.392 3.334c0 1.26.498 2.44 1.398 3.334.144.14.291.272.448.391a4.667 4.667 0 0 1-1.097-3.005 4.724 4.724 0 0 1 1.394-3.333zM18.283 8.5v-.67h-.006a3.824 3.824 0 0 1-2.319-.777A3.828 3.828 0 0 0 18.284 8.5z"
          fill="#08FFF9"
        />
        <path
          d="M10.294 17.521c.297.016.582-.025.846-.11a2.258 2.258 0 0 0 1.563-2.14l.003-3.728V4.732H14.5a3.9 3.9 0 0 1-.076-.721h-2.469v6.808l-.003 3.729c0 .996-.655 1.842-1.563 2.14a2.298 2.298 0 0 1-1.886-.207c.385.596 1.043 1 1.792 1.04z"
          fill="#08FFF9"
        />
        <path
          d="M10.388 19.213a4.752 4.752 0 0 0 2.657-1.328 4.663 4.663 0 0 0 1.397-3.315l-.012-5.574c.426.329.893.604 1.397.814.78.33 1.607.498 2.457.498V8.501a3.827 3.827 0 0 1-2.325-1.448 3.839 3.839 0 0 1-1.457-2.322h-1.796v6.809l-.003 3.728c0 .997-.655 1.843-1.563 2.14a2.224 2.224 0 0 1-.846.11A2.286 2.286 0 0 1 8.5 16.481a2.255 2.255 0 0 1-1.112-1.902c-.019-1.26 1.009-2.287 2.281-2.287.25 0 .492.04.718.113V10.55a4.768 4.768 0 0 0-3.347 1.388 4.693 4.693 0 0 0-1.39 3.33c0 1.11.385 2.162 1.096 3.005.833.643 1.852.99 2.923.99a4.55 4.55 0 0 0 .718-.05z"
          fill="#212121"
        />
      </symbol>
      <symbol id="icon-social-twitch" viewBox="0 0 25 24">
        <path d="M4.003 4.001h16v10l-5 5h-11v-15z" fill="#fff" />
        <path
          d="M21.003 3.001v11.74l-4.696 4.695h-3.913l-2.437 2.348h-3.04v-2.348H3.002V6.131l1.227-3.13h16.773zm-1.565 1.565H6.133v11.74h3.13v2.347l2.35-2.348h4.694l3.13-3.13V4.566h.001zm-3.13 3.13v4.696h-1.566V7.697H16.308zm-3.914 0v4.696H10.83V7.697h1.565z"
          fill="#663EA3"
        />
      </symbol>
      <symbol id="icon-social-twitter" viewBox="0 0 25 24">
        <g clipPath="url(#social-twitter-a)">
          <path
            d="M22.165 6.658a8.383 8.383 0 0 1-2.402.658 4.196 4.196 0 0 0 1.84-2.314c-.82.488-1.719.83-2.656 1.015a4.182 4.182 0 0 0-7.126 3.814 11.874 11.874 0 0 1-8.62-4.37 4.168 4.168 0 0 0-.566 2.103c0 1.45.738 2.731 1.86 3.481a4.168 4.168 0 0 1-1.894-.523v.052a4.185 4.185 0 0 0 3.355 4.101 4.21 4.21 0 0 1-1.89.072 4.185 4.185 0 0 0 3.907 2.905 8.395 8.395 0 0 1-6.19 1.732 11.83 11.83 0 0 0 6.41 1.88c7.692 0 11.9-6.373 11.9-11.9 0-.18-.006-.362-.014-.54a8.495 8.495 0 0 0 2.087-2.165v-.001z"
            fill="#00ABEB"
          />
        </g>
      </symbol>
      <symbol id="icon-social-vk" viewBox="0 0 25 24">
        <path
          d="M2.002 11.599c0-4.525 0-6.788 1.406-8.194 1.407-1.407 3.67-1.407 8.194-1.407h.8c4.526 0 6.788 0 8.194 1.407 1.407 1.406 1.407 3.669 1.407 8.194v.8c0 4.525 0 6.788-1.407 8.194-1.406 1.406-3.668 1.406-8.194 1.406h-.8c-4.525 0-6.787 0-8.194-1.406-1.406-1.406-1.406-3.669-1.406-8.194v-.8z"
          fill="#fff"
        />
        <path
          d="M2.002 11.599c0-4.525 0-6.788 1.406-8.194 1.407-1.407 3.67-1.407 8.194-1.407h.8c4.526 0 6.788 0 8.194 1.407 1.407 1.406 1.407 3.669 1.407 8.194v.8c0 4.525 0 6.788-1.407 8.194-1.406 1.406-3.668 1.406-8.194 1.406h-.8c-4.525 0-6.787 0-8.194-1.406-1.406-1.406-1.406-3.669-1.406-8.194v-.8z"
          fill="url(#social-vk-a)"
        />
        <path
          d="M2.002 11.599c0-4.525 0-6.788 1.406-8.194 1.407-1.407 3.67-1.407 8.194-1.407h.8c4.526 0 6.788 0 8.194 1.407 1.407 1.406 1.407 3.669 1.407 8.194v.8c0 4.525 0 6.788-1.407 8.194-1.406 1.406-3.668 1.406-8.194 1.406h-.8c-4.525 0-6.787 0-8.194-1.406-1.406-1.406-1.406-3.669-1.406-8.194v-.8z"
          fill="#2C84F2"
        />
        <path
          d="M12.646 16.406c-4.556 0-7.156-3.125-7.269-8.326H7.66c.075 3.82 1.756 5.432 3.093 5.77V8.08h2.15v3.294c1.32-.143 2.7-1.643 3.17-3.294h2.15c-.357 2.032-1.857 3.532-2.926 4.15 1.07.5 2.776 1.807 3.425 4.176h-2.368c-.507-1.581-1.775-2.807-3.45-2.975v2.975h-.257z"
          fill="#fff"
        />
      </symbol>
      <symbol id="icon-social-website" viewBox="0 0 25 24">
        <path
          fillRule="evenodd"
          clipRule="evenodd"
          d="M11.357 2.01c-1.563.15-2.502.392-3.7.953-1.055.494-1.936 1.12-2.814 1.997A9.958 9.958 0 0 0 2.94 7.6c-.202.407-.536 1.218-.536 1.3 0 .009.368.015.819.015h.819l.125-.306c.16-.39.65-1.241.71-1.236.025.002.39.007.81.01l.763.006-.095.342c-.053.189-.138.532-.188.764l-.093.42h1.594l.122-.48c.067-.263.163-.602.215-.753l.094-.274 3.873-.01 3.874-.01.146.48c.08.264.177.607.214.763l.067.284h.802c.746 0 .8-.005.781-.068a11.612 11.612 0 0 1-.102-.44 13.447 13.447 0 0 0-.173-.694l-.092-.321.791-.011c.75-.011.796-.008.86.067.106.122.49.83.63 1.163l.129.303h.816c.45.001.817-.007.817-.016 0-.089-.333-.895-.551-1.333a10.065 10.065 0 0 0-7.694-5.482c-.428-.057-1.623-.102-1.929-.073zm1.299 1.63c.672.193 1.34.68 1.886 1.377.237.303.534.74.534.785 0 .012-1.399.021-3.109.021s-3.11-.01-3.11-.021c0-.056.453-.695.679-.957.938-1.091 2.037-1.515 3.12-1.205zM7.488 5.048a8.994 8.994 0 0 0-.307.55l-.11.225h-.447c-.256 0-.438-.015-.425-.035C6.279 5.66 7.63 4.67 7.67 4.71c.008.008-.074.16-.183.339zm9.615.21c.152.115.364.288.473.385l.196.177-.454.002-.454.001-.13-.264a7.602 7.602 0 0 0-.303-.543 2.725 2.725 0 0 1-.174-.303c0-.035.524.303.846.546zM2.135 10.39c-.224.048-.21.099.446 1.679.34.817.635 1.508.658 1.535.03.037.164.047.498.04l.457-.012.186-.372c.102-.204.3-.626.441-.936.192-.426.262-.546.283-.49.104.287.74 1.694.791 1.75.052.056.132.068.483.068s.431-.011.482-.069c.108-.119 1.336-2.934 1.322-3.03-.021-.148-.169-.192-.593-.18-.323.01-.394.023-.456.09-.04.042-.22.456-.398.919-.179.463-.337.854-.352.87-.015.016-.192-.363-.394-.841-.202-.479-.4-.906-.442-.949-.066-.068-.128-.078-.467-.078-.344 0-.398.01-.448.077-.046.064-.362.764-.767 1.704-.074.171-.077.173-.113.078-.02-.054-.167-.464-.325-.91-.159-.448-.31-.844-.337-.88-.04-.055-.124-.068-.457-.075a4.067 4.067 0 0 0-.498.012zm6.94 0c-.115.031-.178.092-.178.171 0 .094 1.177 2.935 1.252 3.022.05.058.129.069.5.069.307 0 .454-.015.481-.049.035-.044.54-1.116.765-1.626l.092-.207.389.9c.214.494.408.917.43.94.026.025.225.042.487.042.417 0 .447-.005.502-.089.096-.146 1.32-2.93 1.32-3.004 0-.142-.11-.175-.58-.175-.381 0-.457.01-.5.068-.027.037-.194.443-.371.9l-.35.901c-.02.049-.144-.205-.417-.85-.213-.505-.415-.942-.449-.97-.091-.075-.815-.068-.889.01-.046.047-.404.835-.793 1.745l-.065.153-.326-.914c-.18-.502-.356-.943-.392-.978-.05-.05-.15-.067-.448-.072a3.233 3.233 0 0 0-.46.014zm6.867.023a.21.21 0 0 0-.11.148c-.008.08 1.045 2.701 1.208 3.004.044.082.072.087.492.087.374 0 .454-.011.506-.069.065-.072.817-1.668.817-1.733 0-.084.072-.03.12.09.14.347.678 1.547.729 1.624.054.083.084.088.505.088.31 0 .459-.015.486-.049.022-.027.335-.717.696-1.534.738-1.666.731-1.637.395-1.687-.241-.036-.75-.002-.818.054-.03.025-.211.45-.403.946-.192.495-.361.887-.377.87a16.767 16.767 0 0 1-.392-.89c-.2-.473-.387-.887-.417-.92-.042-.044-.149-.058-.446-.058-.34 0-.4.01-.465.078-.04.043-.247.48-.46.97-.211.49-.39.886-.396.88a36.005 36.005 0 0 1-.332-.91c-.177-.496-.347-.927-.378-.958-.077-.08-.82-.104-.96-.031zM2.403 15.114c0 .008.063.188.14.4.307.844.907 1.896 1.545 2.712.318.406 1.136 1.232 1.542 1.556 1.51 1.203 3.202 1.916 5.156 2.172.482.063 1.88.063 2.362 0a10.097 10.097 0 0 0 7.832-5.505c.218-.438.551-1.244.551-1.332 0-.01-.367-.018-.817-.018l-.816.001-.128.303c-.142.334-.525 1.04-.631 1.164-.064.074-.11.077-.86.067l-.79-.012.074-.262c.042-.145.12-.457.173-.694.055-.236.108-.46.12-.498.019-.064-.037-.069-.782-.069h-.802l-.067.284c-.037.156-.133.5-.213.763l-.147.48-3.874-.01-3.873-.01-.094-.274c-.052-.15-.148-.49-.215-.754l-.122-.479H6.073l.093.42c.05.232.135.576.188.764l.095.342-.763.006c-.42.003-.785.008-.81.01-.06.005-.55-.846-.71-1.236l-.125-.306h-.82c-.45 0-.818.007-.818.015zm4.778 3.302c.06.124.197.368.303.543.106.176.193.33.193.342 0 .066-.97-.624-1.338-.95l-.177-.157.454-.002.454-.001.11.225zm7.895-.204c0 .046-.297.483-.534.786a4.906 4.906 0 0 1-1 .953c-1.34.907-2.8.622-4.006-.782-.226-.262-.678-.9-.678-.957 0-.011 1.399-.021 3.109-.021s3.11.01 3.11.021zm2.677-.003c0 .073-1.443 1.143-1.486 1.101-.006-.006.082-.17.196-.362.114-.192.25-.442.303-.553l.095-.204h.446c.245 0 .446.008.446.018z"
          fill="url(#social-website-a)"
        />
      </symbol>
      <symbol id="icon-social-yappy" viewBox="0 0 25 24">
        <rect
          x="2.003"
          y="2.001"
          width={20}
          height={20}
          rx={5}
          fill="#2ADEB6"
        />
        <path
          fillRule="evenodd"
          clipRule="evenodd"
          d="M12.65 9.802c.173 1.655 1.48 2.942 3.067 2.942 1.705 0 3.086-1.484 3.086-3.315 0-.232-.022-.458-.064-.677l-6.088 1.05zM4.99 11.009C5.14 12.688 6.457 14 8.06 14c1.705 0 3.086-1.483 3.086-3.314 0-.25-.025-.492-.074-.725L4.99 11.009z"
          fill="#fff"
        />
        <path
          fillRule="evenodd"
          clipRule="evenodd"
          d="M6.614 12.42a2.46 2.46 0 0 1-.725-1.546l4.403-.759c.035.17.054.345.054.525 0 1.325-1 2.399-2.234 2.399-.176 0-.347-.022-.511-.063a.571.571 0 1 0-.986-.556zM14.157 11.162a2.46 2.46 0 0 1-.725-1.545l4.403-.76c.035.17.054.345.054.525 0 1.325-1 2.4-2.234 2.4a2.09 2.09 0 0 1-.511-.064.571.571 0 1 0-.987-.556z"
          fill="#000"
        />
        <path
          fill="#000"
          d="M4.715 10.79l6.541-1.104.048.284-6.541 1.104zM12.289 9.532l6.541-1.104.053.31-6.542 1.104z"
        />
        <path
          d="M13.832 13.944s-.286 1.486-2.058.972"
          stroke="#000"
          strokeWidth=".286"
        />
      </symbol>
      <symbol id="icon-social-youtube" viewBox="0 0 25 24">
        <path
          fillRule="evenodd"
          clipRule="evenodd"
          d="M8.908 18.546V5.458l7.742 6.547-7.739 6.541h-.003z"
          fill="#fff"
        />
        <path
          d="M21.834 8.283c-.111-1.311-.905-2.965-2.537-3.024-4.555-.301-9.951-.384-14.59 0-1.438.159-2.424 1.885-2.532 3.196-.227 2.754-.227 4.32 0 7.075.109 1.31 1.07 3.046 2.535 3.229 4.693.301 10.063.344 14.59 0 1.42-.243 2.426-1.919 2.535-3.23.226-2.755.226-4.493-.001-7.246zm-12.33 7.202v-7.06l6.25 3.53-6.25 3.53z"
          fill="#fff"
        />
        <path
          d="M21.834 8.283c-.111-1.311-.905-2.965-2.537-3.024-4.555-.301-9.951-.384-14.59 0-1.438.159-2.424 1.885-2.532 3.196-.227 2.754-.227 4.32 0 7.075.109 1.31 1.07 3.046 2.535 3.229 4.693.301 10.063.344 14.59 0 1.42-.243 2.426-1.919 2.535-3.23.226-2.755.226-4.493-.001-7.246zm-12.33 7.202v-7.06l6.25 3.53-6.25 3.53z"
          fill="url(#social-youtube-a)"
        />
        <path
          d="M21.834 8.283c-.111-1.311-.905-2.965-2.537-3.024-4.555-.301-9.951-.384-14.59 0-1.438.159-2.424 1.885-2.532 3.196-.227 2.754-.227 4.32 0 7.075.109 1.31 1.07 3.046 2.535 3.229 4.693.301 10.063.344 14.59 0 1.42-.243 2.426-1.919 2.535-3.23.226-2.755.226-4.493-.001-7.246zm-12.33 7.202v-7.06l6.25 3.53-6.25 3.53z"
          fill="#EE3C34"
        />
      </symbol>
      <symbol id="icon-social-zen" viewBox="0 0 25 24">
        <rect x={2} y="2.001" width={20} height={20} rx={10} fill="#272A35" />
        <path
          d="M12.145 21.995c0-.276-.008-.523.002-.77.056-1.491.088-2.985.37-4.458.447-2.321 1.923-3.829 4.261-4.237 1.023-.179 2.067-.245 3.104-.33.689-.055 1.383-.052 2.088-.077.01.066.024.117.024.167 0 1.735.02 3.471-.014 5.206-.024 1.26-.416 2.395-1.367 3.285a4.114 4.114 0 0 1-2.384 1.117c-.531.061-1.068.088-1.603.092-1.409.013-2.818.005-4.226.005h-.255zM2.009 12.156c.433 0 .845-.02 1.253.004 1.04.062 2.082.12 3.118.224.948.094 1.87.316 2.704.807 1.31.772 2.034 1.95 2.354 3.407.255 1.152.318 2.326.367 3.498.026.62.005 1.243.005 1.886.015-.004-.013.01-.042.01-1.759-.003-3.518.016-5.277-.018-1.07-.02-2.07-.31-2.91-1.024-.83-.705-1.327-1.596-1.473-2.67-.066-.483-.09-.974-.094-1.462-.012-1.471-.005-2.942-.005-4.413v-.249zM21.996 11.885c-1.056-.05-2.077-.065-3.09-.155-.866-.075-1.741-.163-2.58-.37-2.16-.535-3.403-1.984-3.792-4.14-.186-1.037-.254-2.099-.328-3.152-.048-.672-.01-1.351-.01-2.058h.205c1.597 0 3.192-.012 4.789.003 1.173.012 2.286.243 3.219 1.028.84.706 1.341 1.605 1.488 2.689.066.483.09.974.095 1.463.012 1.463.004 2.927.005 4.39l-.001.302zM11.87 2.01c-.024.727-.022 1.42-.077 2.11-.082 1.021-.152 2.049-.32 3.058-.272 1.643-1.091 2.945-2.605 3.74-.782.411-1.632.619-2.501.692-1.387.115-2.778.171-4.168.251-.052.004-.106 0-.17 0-.008-.05-.018-.086-.018-.123.002-1.75-.023-3.502.016-5.252.034-1.498.586-2.77 1.851-3.66a4.107 4.107 0 0 1 2.267-.764c1.477-.044 2.955-.038 4.432-.052.418-.003.837 0 1.293 0z"
          fill="#fff"
        />
      </symbol>
      <symbol id="icon-user" viewBox="0 0 24 24">
        <path d="M12 2c5.52 0 10 4.48 10 10s-4.48 10-10 10S2 17.52 2 12 6.48 2 12 2zM6.023 15.416C7.491 17.606 9.695 19 12.16 19c2.464 0 4.669-1.393 6.136-3.584A8.968 8.968 0 0 0 12.16 13a8.968 8.968 0 0 0-6.137 2.416zM12 11a3 3 0 1 0 0-6 3 3 0 0 0 0 6z" />
      </symbol>
    </svg>
  </div>
  <div className="actions-page" data-theme="light-02">
    <div
      className="popup-wrap"
      data-popup="filters"
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <form
          className="filters-popup"
          action="https://promo.getblogger.ru/promo?"
          method="get"
        >
          <div className="filters-popup__head filters-popup-head">
            <h3 className="filters-popup-head__title">Фильтры</h3>
            <button
              className="filters-popup-head__close"
              type="button"
              data-close-popup=""
            >
              <svg width={24} height={24}>
                <use href="#icon-close" />
              </svg>
            </button>
          </div> 
          <div className="filters-popup__content">
            <div className="filters-popup-fields">
              <h4 className="filters-popup-fields__title">Сортировка</h4>
              <div className="filters-inputs" data-filter-inputs="">
                <div className="filters-inputs__item">
                  <input
                    id="sort-popular"
                    type="radio"
                    name="sorting"
                    defaultValue="popular"
                    defaultChecked=""
                  />
                  <label htmlFor="sort-popular">Сначала популярные</label>
                </div>
                <div className="filters-inputs__item">
                  <input
                    id="sort-new"
                    type="radio"
                    name="sorting"
                    defaultValue="new"
                  />
                  <label htmlFor="sort-new">Сначала новые</label>
                </div>
              </div>
            </div>
            <div className="filters-popup-fields">
              <h4 className="filters-popup-fields__title">Категории</h4>
              <div className="filters-inputs" data-filter-inputs="">
                <div className="filters-inputs__item">
                  <input
                    id="cat_all"
                    type="checkbox"
                    name="categories"
                    defaultValue=""
                    defaultChecked=""
                    data-select-all="all"
                  />
                  <label htmlFor="cat_all">Все</label>
                </div>
                <div className="filters-inputs__item">
                  <input
                    id="cat_1"
                    type="checkbox"
                    name="categories[]"
                    defaultValue={1}
                  />
                  <label htmlFor="cat_1">Онлайн-сервисы</label>
                </div>
                <div className="filters-inputs__item">
                  <input
                    id="cat_2"
                    type="checkbox"
                    name="categories[]"
                    defaultValue={2}
                  />
                  <label htmlFor="cat_2">Финансовые продукты</label>
                </div>
                <div className="filters-inputs__item">
                  <input
                    id="cat_3"
                    type="checkbox"
                    name="categories[]"
                    defaultValue={3}
                  />
                  <label htmlFor="cat_3">Еда и напитки</label>
                </div>
                <div className="filters-inputs__item">
                  <input
                    id="cat_4"
                    type="checkbox"
                    name="categories[]"
                    defaultValue={4}
                  />
                  <label htmlFor="cat_4">Маркетплейсы</label>
                </div>
                <div className="filters-inputs__item">
                  <input
                    id="cat_5"
                    type="checkbox"
                    name="categories[]"
                    defaultValue={5}
                  />
                  <label htmlFor="cat_5">Красота и здоровье</label>
                </div>
                <div className="filters-inputs__item">
                  <input
                    id="cat_6"
                    type="checkbox"
                    name="categories[]"
                    defaultValue={6}
                  />
                  <label htmlFor="cat_6">Мода</label>
                </div>
                <div className="filters-inputs__item">
                  <input
                    id="cat_7"
                    type="checkbox"
                    name="categories[]"
                    defaultValue={7}
                  />
                  <label htmlFor="cat_7">Путешествия</label>
                </div>
                <div className="filters-inputs__item">
                  <input
                    id="cat_10"
                    type="checkbox"
                    name="categories[]"
                    defaultValue={10}
                  />
                  <label htmlFor="cat_10">Спорт</label>
                </div>
                <div className="filters-inputs__item">
                  <input
                    id="cat_11"
                    type="checkbox"
                    name="categories[]"
                    defaultValue={11}
                  />
                  <label htmlFor="cat_11">Дом и ремонт</label>
                </div>
                <div className="filters-inputs__item">
                  <input
                    id="cat_12"
                    type="checkbox"
                    name="categories[]"
                    defaultValue={12}
                  />
                  <label htmlFor="cat_12">Товары для животных</label>
                </div>
              </div>
            </div>
            <div className="filters-popup-fields">
              <h4 className="filters-popup-fields__title">Бренды</h4>
              <div className="filters-inputs" data-filter-inputs="">
                <div className="filters-inputs__item">
                  <input
                    id="brands_all"
                    type="checkbox"
                    name="brands"
                    defaultValue=""
                    defaultChecked=""
                    data-select-all="all"
                  />
                  <label htmlFor="brands_all">Все</label>
                </div>
                <div className="filters-inputs__item">
                  <input
                    id="brands_42664"
                    type="checkbox"
                    name="brands[]"
                    defaultValue={42664}
                  />
                  <label htmlFor="brands_42664">СберМаркет</label>
                </div>
              </div>
            </div>
          </div>
          <div className="filters-popup__buttons">
            <div className="filters-popup-buttons">
              <div className="filters-popup-buttons__item">
                <button
                  className="filters-popup-buttons__button filters-popup-buttons__button--reset"
                  id="reset_filter"
                  type="reset"
                >
                  Сбросить всё
                </button>
              </div>
              <div className="filters-popup-buttons__item">
                <button
                  className="filters-popup-buttons__button filters-popup-buttons__button--submit"
                  type="submit"
                >
                  Применить
                </button>
              </div>
            </div>
          </div>
        </form>
      </div>
    </div>
    <div className="summary" />
    <div
      className="popup-wrap"
      data-popup={941992}
      data-ym-id={10269}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
          
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_a2934a3d2a470ea5ded1fc96871ec417.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_7ac7df87f0d60c7a2b545014ddf48c60.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">{data}</h4>
                      <p className="actions-grid-item__category">
                        Онлайн-сервисы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 2 октября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Яндекс 360 — скидка до 70% на подписку для новых клиентов!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ЯНДЕКС» , ИНН 7736207543 <br />
                  erid: Kra23e4CT{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку до 70% на первую подписку Яндекс 360! Храните
                  воспоминания с Яндекс 360 — до 3ТБ на Диске, безлимит для фото
                  и видео с телефона! Уникальное предложение на подписку Яндекс
                  360 доступно новым пользователям и пользователям с тарифом, в
                  котором объём диска меньше, чем в приобретаемом. Возможности:
                  — До 3ТБ памяти на Диске — безлимит на Диске для фото и видео
                  с телефона — почта без рекламы и с возможностью создания
                  красивого адреса — и многое другое. Только в сентябре скидка
                  по промокоду на тарифы 200ГБ и 1 ТБ суммируется с акцией на
                  сайте! Оформите подписку по мегавыгодной цене: — 200ГБ за 119р
                  вместо 199р при подписке на месяц — 1ТБ за 239р вместо 399р
                  при подписке на месяц — 200ГБ за 384р вместо 1290р при
                  подписке на год — 1ТБ за 912р вместо 2290р при подписке на год{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text={221778}
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      221778
                    </strong>
                  </div>
                </div>

                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/ceXfYv?erid=Kra23e4CT"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
             
          </div>
         
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={943120}
      data-ym-id={10271}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_f56cc86a873a0d92a64b4508c9981b6d.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_2a07788dfc09961df202c48022ee950c.jpeg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">СберМаркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  СберМаркет — Скидка 700 ₽ на первый заказ в Магнит от 1 500 ₽!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ИНСТАМАРТ СЕРВИС» , ИНН 9705118142 <br />
                  erid: Kra243Vsi{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 700 руб. на свой первый заказ от 1 500 руб. в
                  Магнит по уникальному промокоду. Лучшее время, чтобы совершить
                  свой первый заказ в СберМаркете на выгодных условиях! Текущий
                  промокод суммируется со всеми акциями и скидками на товары.
                  Бесплатная доставка любого заказа от любой суммы! Акция
                  доступна по всей России за исключением Ишима и Ижевска.
                  Доступность сервиса в вашем городе проверяйте в мобильном
                  приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="shles7aj"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      shles7aj
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://sbermarket.ru/?utm_content=tdyqe&utm_medium=cpa&utm_campaign=shles7aj&utm_source=getblogger&oid=rs1fv2hzo&wid=tdyqe&statid=6_shles7aj&sub=shles7aj&sub2=83018&erid=Kra243Vsi"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={943124}
      data-ym-id={10272}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_b7274c081aa2c0f24efccd71daaedfe0.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_6eabdfa880d128051136425e6d7fdb02.jpeg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">СберМаркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  СберМаркет — Скидка 700 ₽ на первый заказ в Магнит Семейный от
                  1 500 ₽!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ИНСТАМАРТ СЕРВИС» , ИНН 9705118142 <br />
                  erid: Kra23w7j2{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 700 руб. на свой первый заказ от 1 500 руб. в
                  Магнит Семейный по уникальному промокоду. Лучшее время, чтобы
                  совершить свой первый заказ в СберМаркете на выгодных
                  условиях! Текущий промокод суммируется со всеми акциями и
                  скидками на товары. Бесплатная доставка любого заказа от любой
                  суммы! Акция доступна по всей России за исключением Ишима и
                  Ижевска. Доступность сервиса в вашем городе проверяйте в
                  мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="txq7j7nx"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      txq7j7nx
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://sbermarket.ru/?utm_content=tdyqe&utm_medium=cpa&utm_campaign=txq7j7nx&utm_source=getblogger&oid=rs1fv2hzo&wid=tdyqe&statid=6_txq7j7nx&sub=txq7j7nx&sub2=83018&erid=Kra23w7j2"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={943133}
      data-ym-id={10273}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_a51fa13a0385be7159fadd374fa9c37c.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_2e6620503f647a1ceb76cc8f3baf79d6.jpeg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">СберМаркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  СберМаркет — Скидка 700 ₽ на первый заказ в Магнит Косметик от
                  1 500 ₽!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ИНСТАМАРТ СЕРВИС» , ИНН 9705118142 <br />
                  erid: Kra23adME{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 700 руб. на свой первый заказ от 1 500 руб. в
                  Магнит Косметик по уникальному промокоду. Лучшее время, чтобы
                  совершить свой первый заказ в СберМаркете на выгодных
                  условиях! Текущий промокод суммируется со всеми акциями и
                  скидками на товары. Бесплатная доставка любого заказа от любой
                  суммы! Акция доступна по всей России за исключением Ишима и
                  Ижевска. Доступность сервиса в вашем городе проверяйте в
                  мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="ktx0ectt"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      ktx0ectt
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://sbermarket.ru/?utm_content=tdyqe&utm_medium=cpa&utm_campaign=ktx0ectt&utm_source=getblogger&oid=rs1fv2hzo&wid=tdyqe&statid=6_ktx0ectt&sub=ktx0ectt&sub2=83018&erid=Kra23adME"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={940716}
      data-ym-id={10265}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_78ab92a5a5afba3b91473c7526c7feb7.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_4b49f0e1edf97c11e73a0ebed2898e67.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Росбанк</h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Росбанк — кешбэк 2500 рублей за покупки по кредитной карте
                  #120наВСЁ Плюс{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ПАО «РОСБАНК» , ИНН 7730060164 <br />
                  erid: Kra249Gwd{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи 2 500 руб кешбэка за любые покупки в сентябре на общую
                  сумму от 10 000 руб. при оформлении кредитной карты Мир
                  #120наВСЕ Плюс по уникальной ссылке до 30.09. Акция доступна
                  только для новых клиентов по всей России. Период совершения
                  покупок, за которые можно получить кешбэк: с 01.09.2023 по
                  30.09.2023. - 120 дней без % - Снятие наличных без % -
                  Переводы без % Получайте повышенный кешбэк рублями до 3 % от
                  банка на выбор в одной из 20 категорий! За любые другие
                  покупки 1% кешбека рублями! Максимальная сумма стандартного
                  кешбэка на 1 клиента: 10 000 руб. В месяц итого можно получить
                  до 12 500 руб! Акция доступна только для новых клиентов по
                  всей России. Кешбэк необходимо подключить в мобильном банке.
                  Единоразовая комиссия за оформление кредитной карты (в том
                  числе для цифровой кредитной карты): для категорий «Зарплатный
                  клиент» и «Премиальный клиент» - 900 руб.; Клиенты не
                  относящиеся к категории - 1 800 руб. Оплаты, совершенные через
                  СБП не учитываются в акции.{" "}
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/veZomj?erid=Kra249Gwd"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={940720}
      data-ym-id={10264}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_405ca9d7d09487fc5161868ec63bcdcc.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_236955ce4dca485134e249f9d4b9046b.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">
                        Ренессанс Кредит
                      </h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Ренессанс Банк — кредитная карта 2 года без % + бесплатное
                  обслуживание навсегда!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО Коммерческий банк «Ренессанс Кредит» , ИНН
                  7744000126 <br />
                  erid: Kra247w1u{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформи кредитную карту «2 года без %» по уникальной ссылке и
                  получи бесплатное обслуживание навсегда, а также: - 2 года без
                  % на все покупки в первый месяц - 200 дней без % на покупки со
                  второго месяца - скидки и кэшбэк до 50% по акциям от платёжной
                  системы «Мир» и партнёров банка Акция доступна для клиентов
                  только при одновременном соблюдении следующих условий: -
                  физические лица - граждане/ки Российской Федерации, достигшие
                  20 лет; - не являются сотрудниками Банка; - не имеют
                  действующей Кредитной карты на момент присоединения к Акции; С
                  полным списком городов присутствия офисов банка можно
                  ознакомиться по ссылке:{" "}
                  <a
                    href="https://rencredit.ru/addresses/"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    https://rencredit.ru/addresses/
                  </a>
                  Оформить доставку карты на дом возможно в следующих городах:
                  Барнаул, Архангельск, Астрахань, Белгород, Брянск, Владимир,
                  Волгоград, Волжский, Вологда, Череповец, Воронеж, Чита,
                  Иркутск, Калининград, Калуга, Кемерово, Новокузнецк, Киров,
                  Кострома, Краснодар, Новороссийск, Сочи, Красноярск, Курск,
                  Санкт-Петербург, Липецк, Москва, Мурманск, Нижний Новгород,
                  Великий Новгород, Омск, Оренбург, Орел, Пенза, Пермь,
                  Владивосток, Псков, Стерлитамак, Улан-Удэ, Петрозаводск,
                  Сыктывкар, Йошкар-Ола, Саранск, Якутск, Казань, Набережные
                  Челны, Абакан, Ростов-на-Дону, Рязань, Самара, Тольятти,
                  Саратов, Екатеринбург, Смоленск, Пятигорск, Ставрополь,
                  Тамбов, Томск, Тула, Тюмень, Ижевск, Ульяновск, Хабаровск,
                  Нижневартовск, Сургут, Магнитогорск, Челябинск, Чебоксары,
                  Ярославль.{" "}
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/MeL68M?erid=Kra247w1u"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={940724}
      data-ym-id={10256}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_d3a523a1c344a410caaaf31cd5f42994.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_bf7e668feef262484962fc19bad6d8ba.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Газпромбанк</h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Газпромбанк дебетовая карта «Мир» – оформите карту и получите
                  сертификат на 1000 руб. на Ozon!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Банк ГПБ» , ИНН 7744001497 <br />
                  erid: Kra23jmJs{" "}
                </p>
                <p className="actions-grid-item__details">
                  Примените промокод по ссылке, оформите дебетовую карту «Мир»
                  на сайте Газпромбанка, совершите покупку от 250 руб. в течение
                  30 дней после активации и получите сертификат от Оzon на 1000
                  руб! Сертификат на Ozon придет в течение 30 дней после
                  совершенной покупки на 250 руб. Акция доступна для
                  дееспособных граждан РФ, достигших 18-летнего возраста, у
                  которых нет дебетовой карты Газпромбанка. — Дополнительная
                  акция "Получайте кешбэк 15% на Яндекс Драйв" 1. Оформите
                  дебетовую карту Газпромбанка с 01.09.23 по 29.02.24. Если
                  такая карта у вас уже есть — она тоже участвует в акции. 2.
                  Оплачивайте поездки Яндекс Драйв дебетовой картой
                  Газпромбанка. 3. Получайте кешбэк 15% рублями на карту.
                  Максимум — 500 ₽ в месяц, 1 000 ₽ за весь период акции. Период
                  действия акции: с 01.09.23 по 29.02.24. Карту можно получить
                  доставкой на дом или забрать в офисе Газпромбанка.
                  Предпочтительный способ получения карты можно указать на сайте
                  при оформлении заявки или сообщить сотруднику банка по
                  телефону. Перечень городов, в которых возможна бесплатная
                  доставка: Алейск, Альметьевск, Ангарск, Арзамас, Архангельск,
                  Астрахань, Ачинск, Балаково, Балашиха, Барнаул, Белгород,
                  Белово, Бердск, Березники, Березовка, Березовский,
                  Березовский, Бийск, Благовещенск, Бор, Брянск, Бугульма,
                  Верхняя Пышма, Видное, Владивосток, Владимир, Волгоград,
                  Волгодонск, Волжский, Вологда, Воронеж, Воскресенск, Воткинск,
                  Всеволожск, Глазов, Губкин, Д, Дзержинск, Дивногорск,
                  Димитровград, Долгопрудный, Домодедово, Екатеринбург, Елабуга,
                  Елец, Железногорск, Заречный, Заречный, Зеленогорск,
                  Зеленоград, Иваново, Ижевск, Иркутск, Истра, Йошкар-Ола,
                  Казань, Калининград, Калуга, Каменск-Уральский, Камышин,
                  Кемерово, Киров, Кирово-Чепецк, Клинцы, Ковров, Коломна,
                  Колпино, Копейск, Кореновск, Королев, Кострома, Котовск,
                  Красногорск, Краснодар, Красное Село, Краснознаменск,
                  Красноярск, Кронштадт, Кубинка, Курган, Курск, Курчатов,
                  Ленинск-Кузнецкий, Лесной, Липецк, Лобня, Люберцы,
                  Магнитогорск, Мегион, Междуреченск, Можга, Москва, Московский,
                  Мурино, Мурманск, Мценск, Мытищи, Набережные Челны,
                  Невинномысск, Нефтекамск, Нефтеюганск, Нижневартовск,
                  Нижнекамск, Нижний Новгород, Нижний Тагил, Нижняя Тура,
                  Новодвинск, Новокузнецк, Новокуйбышевск, Новомосковск,
                  Новороссийск, Новосибирск, Новоуральск, Новочеркасск, Новый
                  Уренгой, Ногинск, Ноябрьск, Одинцово, Озерск, Омск, Орел,
                  Оренбург, Пенза, Первоуральск, Пермь, Петергоф, Петрозаводск,
                  Петропавловск-Камчатский, Подольск, Псков, Пушкин, Пятигорск,
                  Раменское, Рассказово, Реутов, Рославль, Ростов-на-Дону,
                  Рузаевка, Рязань, Салават, Самара, Санкт-Петербург, Саранск,
                  Саратов, Сафоново, Северодвинск, Северск, Сергиев Посад,
                  Серов, Серпухов, Сестрорецк, Смоленск, Сосновоборск, Сосновый
                  Бор, Сочи, Ставрополь, Старый Оскол, Стерлитамак, Ступино,
                  Сургут, Сыктывкар, Таганрог, Тамбов, Тверь, Темрюк, Тольятти,
                  Томск, Троицк, Туймазы, Тула, Тюмень, Улан-Удэ, Ульяновск,
                  Уссурийск, Уфа, Ухта, Хабаровск, Химки, Чайковский, Чапаевск,
                  Чебоксары, Челябинск, Череповец, Чехов, Чусовой, Шадринск,
                  Шексна, Щекино, Щёлково, Щербинка, Электросталь, Энгельс,
                  Югорск, Южно-Сахалинск, Южноуральск, Якутск, Ярославль Список
                  адресов отделений Газпромбанка:
                  <a
                    href="https://www.gazprombank.ru/offices"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    https://www.gazprombank.ru/offices
                  </a>{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="top476"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      top476
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/aeHOW4?erid=Kra23jmJs"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={940725}
      data-ym-id={10229}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_005f45ad80ec19519f37cc3eb72cf8a6.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_b2e8a54aa4ec62bc4160f69fe3ea399d.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Газпромбанк</h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Газпромбанк дебетовая карта Union Pay – получите кешбэк 3 000
                  руб. и кешбэк до 10 000 руб. от Level.Travel!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Банк ГПБ» , ИНН 7744001497 <br />
                  erid: Kra23Uedy{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформите дебетовую карту UnionPay от Газпромбанка по
                  уникальной ссылке, совершайте покупки от 10 000 руб. в течение
                  3 месяцев подряд и получите кешбэк 3 000 руб! Или тратьте 50
                  000 руб. в течение 3 месяцев подряд и получите кешбэк 5 000
                  руб! Акция доступна клиентам, не имеющим пластиковых карт
                  UnionPay Газпромбанка и заявок на них до 01.05.2023. — До
                  31.12.2023 действует акция совместно с Level.Travel, где можно
                  получить кешбэк до 10 000 руб: 1. Оплати тур или отель в
                  приложении Level.Travel картой UnionPay с 20 марта по 31
                  декабря 2023. 2. Отправляйся в путешествие до 31 декабря 2023
                  включительно. 3. Получите кешбэк 5% от стоимости тура, но не
                  более 10 000 рублей. ! Кешбэк начислится до 20 числа
                  календарного месяца, следующего за датой начала путешествия. —
                  Дополнительная акция «Счастливая покупка», где Газпромбанк
                  разыгрывает 1 000 000 ₽ и 500 других призов! Как принять
                  участие: - С 1 июня по 31 августа 2023 оформите карту «Мир»
                  или UnionPay в пакете услуг «Универсальный». - Расплачивайтесь
                  картой в период акции. - Получите возможность выиграть приз: 1
                  000 000 ₽ или один из 500 призов по 3 000 ₽. В розыгрыше
                  участвуют покупки от 100 руб. Победителя определят и начислят
                  вознаграждение до 27.09.2023. Доступно для новых клиентов, не
                  имеющим карт Газпромбанка с 01.06.2023. Срок проведения:
                  01.06.2023 – 31.08.2023 — Акция «Мили на мечту» Доступно новым
                  клиентам, не имеющим карт Газпромбанка до начала действия
                  акции. - Оформите одну из пластиковых карт по ссылке, выбрав
                  программу лояльности «Аэрофлот Бонус», в период 11 августа
                  августа по 31 октября 2023 - Получите шанс выиграть 15 000
                  миль за покупки от 500 ₽ Общий призовой фонд: - 300 призов для
                  держателей карт UPI в пакете услуг «Универсальный». Чем больше
                  покупок, тем выше шанс на победу. Перечень городов, в которых
                  возможна бесплатная доставка: Алейск, Альметьевск, Ангарск,
                  Арзамас, Архангельск, Астрахань, Ачинск, Балаково, Балашиха,
                  Барнаул, Белгород, Белово, Бердск, Березники, Березовка,
                  Березовский, Березовский, Бийск, Благовещенск, Бор, Брянск,
                  Бугульма, Верхняя Пышма, Видное, Владивосток, Владимир,
                  Волгоград, Волгодонск, Волжский, Вологда, Воронеж,
                  Воскресенск, Воткинск, Всеволожск, Глазов, Губкин, Д,
                  Дзержинск, Дивногорск, Димитровград, Долгопрудный, Домодедово,
                  Екатеринбург, Елабуга, Елец, Железногорск, Заречный, Заречный,
                  Зеленогорск, Зеленоград, Иваново, Ижевск, Иркутск, Истра,
                  Йошкар-Ола, Казань, Калининград, Калуга, Каменск-Уральский,
                  Камышин, Кемерово, Киров, Кирово-Чепецк, Клинцы, Ковров,
                  Коломна, Колпино, Копейск, Кореновск, Королев, Кострома,
                  Котовск, Красногорск, Краснодар, Красное Село, Краснознаменск,
                  Красноярск, Кронштадт, Кубинка, Курган, Курск, Курчатов,
                  Ленинск-Кузнецкий, Лесной, Липецк, Лобня, Люберцы,
                  Магнитогорск, Мегион, Междуреченск, Можга, Москва, Московский,
                  Мурино, Мурманск, Мценск, Мытищи, Набережные Челны,
                  Невинномысск, Нефтекамск, Нефтеюганск, Нижневартовск,
                  Нижнекамск, Нижний Новгород, Нижний Тагил, Нижняя Тура,
                  Новодвинск, Новокузнецк, Новокуйбышевск, Новомосковск,
                  Новороссийск, Новосибирск, Новоуральск, Новочеркасск, Новый
                  Уренгой, Ногинск, Ноябрьск, Одинцово, Озерск, Омск, Орел,
                  Оренбург, Пенза, Первоуральск, Пермь, Петергоф, Петрозаводск,
                  Петропавловск-Камчатский, Подольск, Псков, Пушкин, Пятигорск,
                  Раменское, Рассказово, Реутов, Рославль, Ростов-на-Дону,
                  Рузаевка, Рязань, Салават, Самара, Санкт-Петербург, Саранск,
                  Саратов, Сафоново, Северодвинск, Северск, Сергиев Посад,
                  Серов, Серпухов, Сестрорецк, Смоленск, Сосновоборск, Сосновый
                  Бор, Сочи, Ставрополь, Старый Оскол, Стерлитамак, Ступино,
                  Сургут, Сыктывкар, Таганрог, Тамбов, Тверь, Темрюк, Тольятти,
                  Томск, Троицк, Туймазы, Тула, Тюмень, Улан-Удэ, Ульяновск,
                  Уссурийск, Уфа, Ухта, Хабаровск, Химки, Чайковский, Чапаевск,
                  Чебоксары, Челябинск, Череповец, Чехов, Чусовой, Шадринск,
                  Шексна, Щекино, Щёлково, Щербинка,Электросталь, Энгельс,
                  Югорск, Южно-Сахалинск, Южноуральск, Якутск, Ярославль Список
                  адресов отделений Газпромбанка:
                  <a
                    href="https://www.gazprombank.ru/offices"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    https://www.gazprombank.ru/offices
                  </a>
                  С условиями начисления кешбэка можно ознакомиться по ссылке:{" "}
                  <a
                    href="https://www.gazprombank.ru/upload/files/iblock/394/Programma-loyalnosti-keshbek-s-01.05.2023.pdf"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    https://www.gazprombank.ru/upload/files/iblock/394/Programma-loyalnosti-keshbek-s-01.05.2023.pdf
                  </a>{" "}
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/3eSm7w?erid=Kra23Uedy"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={940726}
      data-ym-id={10250}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_d8bbb3324c8a3239860767c7dbcbcfe6.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_c872988af9443f95f61e3cc2eb790c03.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Газпромбанк</h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Газпромбанк Кредитная «180 дней» — тратьте от 2 000 руб.,
                  получайте кешбэк 1 000 руб. ежемесячно в течение 3-х месяцев!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Банк ГПБ» , ИНН 7744001497 <br />
                  erid: Kra23hQwM{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформите кредитную карту «180 дней» с 01.07.2023 по 30.09.2023
                  по уникальной ссылке, совершайте покупки от 2 000 руб.
                  ежемесячно в течение 3-х календарных месяцев с даты получения
                  карты и получайте кешбэк 1 000 руб. каждый месяц! Максимальный
                  кешбэк 3 000 руб. Акция доступна для дееспособных граждан РФ,
                  достигших 20-летнего возраста, у которых ранее не было
                  кредитной карты Газпромбанка. Карту можно получить доставкой
                  на дом или забрать в офисе Газпромбанка. Предпочтительный
                  способ получения карты можно указать на сайте при оформлении
                  заявки или сообщить сотруднику банка по телефону. Перечень
                  городов, в которых возможна бесплатная доставка: Альметьевск,
                  Ангарск, Арзамас, Архангельск, Астрахань, Ачинск, Балаково,
                  Балашиха, Барнаул Белгород, Белово, Бердск, Березники,
                  Березовский, Березовский, Бийск, Бор, Брянск, Бугульма,
                  Верхняя Пышма, Видное, Владивосток, Владимир, Волгоград,
                  Волжский, Вологда, Воронеж, Воскресенск, Воткинск, Всеволожск,
                  Глазов, Губкин, Дзержинск, Димитровград, Долгопрудный,
                  Домодедово, Екатеринбург, Елабуга, Елец, Железногорск,
                  Зеленогорск, Зеленоград, Иваново, Ижевск, Иркутск, Истра,
                  Йошкар-Ола, Казань, Калининград, Калуга, Каменск-Уральский,
                  Камышин, Кемерово, Киров, Кирово-Чепецк, Клинцы, Коломна,
                  Колпино, Копейск, Кореновск, Королев, Кострома, Красногорск,
                  Краснодар, Красное Село, Красноярск, Кронштадт, Курган, Курск,
                  Курчатов, Ленинск-Кузнецкий, Лесной, Липецк, Лобня, Люберцы,
                  Магнитогорск, Мегион, Междуреченск, Можга, Москва, Московский,
                  Мурино, Мценск, Мытищи, Набережные Челны, Невинномысск,
                  Нефтекамск, Нефтеюганск, Нижневартовск, Нижнекамск, Нижний
                  Новгород, Нижний Тагил, Нижняя Тура, Новокузнецк,
                  Новокуйбышевск, Новомосковск, Новороссийск, Новосибирск,
                  Новоуральск, Новочеркасск, Новый Уренгой, Ногинск, Одинцово,
                  Озерск, Омск, Орел, Оренбург, Пенза, Первоуральск, Пермь,
                  Петергоф, Подольск, Пушкин, Пятигорск, Раменское, Реутов,
                  Рославль, Ростов-на-Дону, Рузаевка, Рязань, Салават, Самара,
                  Санкт-Петербург, Саранск, Саратов, Сафоново, Северск, Сергиев
                  Посад, Серов, Серпухов, Сестрорецк, Смоленск, Сосновый Бор,
                  Сочи, Ставрополь, Старый Оскол, Стерлитамак, Ступино, Сургут,
                  Таганрог, Тамбов, Тверь, Тольятти, Томск, Троицк, Туймазы,
                  Тула, Тюмень, Улан-Удэ, Ульяновск, Уссурийск, Уфа, Хабаровск,
                  Химки, Чайковский, Чебоксары, Челябинск, Череповец, Чехов,
                  Чусовой, Шадринск, Шексна, Щекино, Щёлково, Щербинка,
                  Электросталь, Энгельс, Южно-Сахалинск, Якутск, Ярославль
                  Список адресов отделений Газпромбанка:
                  <a
                    href="https://www.gazprombank.ru/offices"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    https://www.gazprombank.ru/offices
                  </a>{" "}
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/geFG91?erid=Kra23hQwM"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={940728}
      data-ym-id={10251}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_dca8268e8c79563b050f5b6a570a1751.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_48b5478b8f2466d8f6d52afc256eb73b.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Газпромбанк</h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Газпромбанк кредитная карта UnionPay – оплачивайте покупки и
                  получите 180 дней без % и бесплатное обслуживание в первый
                  год!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Банк ГПБ» , ИНН 7744001497 <br />
                  erid: Kra23m7Eb{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформите кредитную карту UnionPay от Газпромбанка по
                  уникальной ссылке до 31.09 и получите 180 дней льготного
                  периода без %, бесплатное обслуживание в первый год, а также
                  возможность снимать наличные до 50 000 руб. без комиссии в
                  более 150 странах мира! Акция доступна для дееспособных
                  граждан РФ, достигших 20-летнего возраста, у которых ранее не
                  было кредитной карты Газпромбанка или для тех, у кого закрыты
                  кредитные карты за 30 дней до оформления заявки на кредитную
                  карту UnionPay. Перечень городов, в которых возможна
                  бесплатная доставка: Алейск, Альметьевск, Ангарск, Арзамас,
                  Архангельск, Астрахань, Ачинск, Балаково, Балашиха, Барнаул,
                  Белгород, Белово, Бердск, Березники, Березовка, Березовский,
                  Березовский, Бийск, Благовещенск, Бор, Брянск, Бугульма,
                  Верхняя Пышма, Видное, Владивосток, Владимир, Волгоград,
                  Волгодонск, Волжский, Вологда, Воронеж, Воскресенск, Воткинск,
                  Всеволожск, Глазов, Губкин, Д, Дзержинск, Дивногорск,
                  Димитровград, Долгопрудный, Домодедово, Екатеринбург, Елабуга,
                  Елец, Железногорск, Заречный, Заречный, Зеленогорск,
                  Зеленоград, Иваново, Ижевск, Иркутск, Истра, Йошкар-Ола,
                  Казань, Калининград, Калуга, Каменск-Уральский, Камышин,
                  Кемерово, Киров, Кирово-Чепецк, Клинцы, Ковров, Коломна,
                  Колпино, Копейск, Кореновск, Королев, Кострома, Котовск,
                  Красногорск, Краснодар, Красное Село, Краснознаменск,
                  Красноярск, Кронштадт, Кубинка, Курган, Курск, Курчатов,
                  Ленинск-Кузнецкий, Лесной, Липецк, Лобня, Люберцы,
                  Магнитогорск, Мегион, Междуреченск, Можга, Москва, Московский,
                  Мурино, Мурманск, Мценск, Мытищи, Набережные Челны,
                  Невинномысск, Нефтекамск, Нефтеюганск, Нижневартовск,
                  Нижнекамск, Нижний Новгород, Нижний Тагил, Нижняя Тура,
                  Новодвинск, Новокузнецк, Новокуйбышевск, Новомосковск,
                  Новороссийск, Новосибирск, Новоуральск, Новочеркасск, Новый
                  Уренгой, Ногинск, Ноябрьск, Одинцово, Озерск, Омск, Орел,
                  Оренбург, Пенза, Первоуральск, Пермь, Петергоф, Петрозаводск,
                  Петропавловск-Камчатский, Подольск, Псков, Пушкин, Пятигорск,
                  Раменское, Рассказово, Реутов, Рославль, Ростов-на-Дону,
                  Рузаевка, Рязань, Салават, Самара, Санкт-Петербург, Саранск,
                  Саратов, Сафоново, Северодвинск, Северск, Сергиев Посад,
                  Серов, Серпухов, Сестрорецк, Смоленск, Сосновоборск, Сосновый
                  Бор, Сочи, Ставрополь, Старый Оскол, Стерлитамак, Ступино,
                  Сургут, Сыктывкар, Таганрог, Тамбов, Тверь, Темрюк, Тольятти,
                  Томск, Троицк, Туймазы, Тула, Тюмень, Улан-Удэ, Ульяновск,
                  Уссурийск, Уфа, Ухта, Хабаровск, Химки, Чайковский, Чапаевск,
                  Чебоксары, Челябинск, Череповец, Чехов, Чусовой, Шадринск,
                  Шексна, Щекино, Щёлково, Щербинка, Электросталь, Энгельс,
                  Югорск, Южно-Сахалинск, Южноуральск, Якутск, Ярославль. Список
                  адресов отделений Газпромбанка:
                  <a
                    href="https://www.gazprombank.ru/offices"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    https://www.gazprombank.ru/offices
                  </a>{" "}
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/qeFV1S?erid=Kra23m7Eb"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={940729}
      data-ym-id={10257}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_5e55a23f7c0b41c0e20b819859254088.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_42bd4528f5f2898a3315324c6d086718.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Газпромбанк</h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Газпромбанк Кредитная карта 180 дней без % — получите
                  сертификат на Оzon на 2000 руб!!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Банк ГПБ» , ИНН 7744001497 <br />
                  erid: Kra23nneF{" "}
                </p>
                <p className="actions-grid-item__details">
                  Примените промокод, оформите кредитную карту 180 дней без % по
                  уникальной ссылке, совершайте покупки на любую сумму в течение
                  30 дней после активации и получите сертификат на 2000 руб. на
                  Оzon! А также льготный период 180 дней без % и бесплатное
                  обслуживание в первый год! Сертификат на Ozon придет в течение
                  30 дней после активации. Активацией считается первая
                  транзакция по карте на любую сумму. Акция доступна для
                  дееспособных граждан РФ, достигших 20-летнего возраста, у
                  которых ранее не было кредитной карты Газпромбанка. Карту
                  можно получить доставкой на дом или забрать в офисе
                  Газпромбанка. Предпочтительный способ получения карты можно
                  указать на сайте при оформлении заявки или сообщить сотруднику
                  банка по телефону. Перечень городов, в которых возможна
                  бесплатная доставка: Альметьевск, Ангарск, Арзамас,
                  Архангельск, Астрахань, Ачинск, Балаково, Балашиха, Барнаул
                  Белгород, Белово, Бердск, Березники, Березовский, Березовский,
                  Бийск, Бор, Брянск, Бугульма, Верхняя Пышма, Видное,
                  Владивосток, Владимир, Волгоград, Волжский, Вологда, Воронеж,
                  Воскресенск, Воткинск, Всеволожск, Глазов, Губкин, Дзержинск,
                  Димитровград, Долгопрудный, Домодедово, Екатеринбург, Елабуга,
                  Елец, Железногорск, Зеленогорск, Зеленоград, Иваново, Ижевск,
                  Иркутск, Истра, Йошкар-Ола, Казань, Калининград, Калуга,
                  Каменск-Уральский, Камышин, Кемерово, Киров, Кирово-Чепецк,
                  Клинцы, Коломна, Колпино, Копейск, Кореновск, Королев,
                  Кострома, Красногорск, Краснодар, Красное Село, Красноярск,
                  Кронштадт, Курган, Курск, Курчатов, Ленинск-Кузнецкий, Лесной,
                  Липецк, Лобня, Люберцы, Магнитогорск, Мегион, Междуреченск,
                  Можга, Москва, Московский, Мурино, Мценск, Мытищи, Набережные
                  Челны, Невинномысск, Нефтекамск, Нефтеюганск, Нижневартовск,
                  Нижнекамск, Нижний Новгород, Нижний Тагил, Нижняя Тура,
                  Новокузнецк, Новокуйбышевск, Новомосковск, Новороссийск,
                  Новосибирск, Новоуральск, Новочеркасск, Новый Уренгой,
                  Ногинск, Одинцово, Озерск, Омск, Орел, Оренбург, Пенза,
                  Первоуральск, Пермь, Петергоф, Подольск, Пушкин, Пятигорск,
                  Раменское, Реутов, Рославль, Ростов-на-Дону, Рузаевка, Рязань,
                  Салават, Самара, Санкт-Петербург, Саранск, Саратов, Сафоново,
                  Северск, Сергиев Посад, Серов, Серпухов, Сестрорецк, Смоленск,
                  Сосновый Бор, Сочи, Ставрополь, Старый Оскол, Стерлитамак,
                  Ступино, Сургут, Таганрог, Тамбов, Тверь, Тольятти, Томск,
                  Троицк, Туймазы, Тула, Тюмень, Улан-Удэ, Ульяновск, Уссурийск,
                  Уфа, Хабаровск, Химки, Чайковский, Чебоксары, Челябинск,
                  Череповец, Чехов, Чусовой, Шадринск, Шексна, Щекино, Щёлково,
                  Щербинка, Электросталь, Энгельс, Южно-Сахалинск, Якутск,
                  Ярославль Список адресов отделений Газпромбанка:
                  <a
                    href="https://www.gazprombank.ru/offices"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    https://www.gazprombank.ru/offices
                  </a>{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="OZON649"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      OZON649
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/7eHxZx?erid=Kra23nneF"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={940731}
      data-ym-id={10266}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_b91bbe47f0d194d540a47841e892a745.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_03acfe98657b7c7913008e976a81c8bc.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">
                        Альфа-Банк Инвестиции
                      </h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Альфа-Банк Инвестиции — открой брокерский счёт и получи 10
                  акций в подарок{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Альфа-банк» , ИНН 7728168971 <br />
                  erid: Kra24BHqD{" "}
                </p>
                <p className="actions-grid-item__details">
                  Откройте брокерский счёт в приложении или на сайте
                  Альфа-Инвестиции, совершите покупку ценных бумаг на 1000
                  рублей и в течение 30 дней получите 10 акций в подарок! Для
                  покупки выбирайте ценные бумаги на сумму не менее 1000 рублей.
                  Акция доступна для всех пользователей, включая клиентов
                  Альфа-Банка, в городах присутствия банка, у которых на данный
                  момент нет и ранее не было брокерского счета Альфа-Инвестиции.
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/aeZSft?erid=Kra24BHqD"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={931630}
      data-ym-id={10237}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_ea8d9efa0fb3931c61578b1861c052e4.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_6acaa3711646f8e329255828fc34bcdd.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Спортмастер</h4>
                      <p className="actions-grid-item__category">Спорт</p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 15 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Спортмастер — 20% на одежду, обувь и аксессуары в
                  интернет-магазине. К школе!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «СПОРТМАСТЕР» , ИНН 7728551528 <br />
                  erid: Kra23tSw6{" "}
                </p>
                <p className="actions-grid-item__details">
                  На старт, внимание, школа! Спортмастер дарит скидку - 20% на
                  одежду, обувь и аксессуары. Начните учебный год со скидок! А
                  ещё вам начислят 4 000 бонусов за покупки до 03.09 от 1 000
                  руб. Бонусы по акции будут зачислены на ваш счет 14.09.
                  Подробнее -{" "}
                  <a
                    href="https://www.sportmaster.ru/promo/51974413/"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    https://www.sportmaster.ru/promo/51974413/
                  </a>
                  Скидка по промокоду суммируется с розничными скидками, при
                  условии, что общая сумма скидки не превышает 50%. Акция не
                  распространяется на бренды Columbia, Salomon, Bask, SHU,
                  KRAKATAU, RedFox, New Balance. Скидки по промокодам не
                  действуют на товары c жёлтыми ценниками и товары, отмеченные
                  знаком «Лучшая цена», «Предложение недели», «Финальная цена»,
                  «Товар дня» и на услуги. Внимание! Для использования промокода
                  необходимо авторизоваться в клубной программе «Спортмастер».{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="B2SG2540"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      B2SG2540
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/feFwj4?erid=Kra23tSw6"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={937384}
      data-ym-id={10268}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_303cec76e73cb0c3f8b10a4651e5e46e.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_5bc63784bfef1fa97212fedc4aa58063.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Food.ru</h4>
                      <p className="actions-grid-item__category">
                        Онлайн-сервисы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Food.ru — скачивай мобильное приложение и читай тысячи
                  рецептов на главной кухне страны!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Корпоративный центр ИКС 5» , ИНН 7728632689{" "}
                  <br />
                  erid: Kra246Jst{" "}
                </p>
                <p className="actions-grid-item__details">
                  Скачивай мобильное приложение Food.ru по уникальной ссылке и
                  читай статьи о любимых блюдах, кулинарные новости, кухонные
                  лайфхаки и инструкции от лучших шеф-поваров. Приложение
                  доступно пользователям по всей России.
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/MeZVJA?erid=Kra246Jst"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={938701}
      data-ym-id={10267}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_e93e5d0e3b773fd0840dccde799b11a7.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_5e94f455e98f3dc8e967f2fb7a5e4dab.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">ЛЭТУАЛЬ</h4>
                      <p className="actions-grid-item__category">
                        Красота и здоровье
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  ЛЭТУАЛЬ — осенние скидки до 50%!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Алькор и Ко» , ИНН 7729265128 <br />
                  erid: Kra23jLsx{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформи заказ по уникальной ссылке и получай скидки до 50% по
                  активным промокодам на сайте!{" "}
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/TeZbI3?erid=Kra23jLsx"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={848677}
      data-ym-id={10054}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_8330bb12aa3fa43ef533a3f9e77943cb.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_ba59a533b4ea33852fbc852242f96927.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Альфа-Банк</h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Альфа-Банк дебетовая карта — получи кэшбэк 1000 руб. и кэшбэк
                  до 5% на 4 категории!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Альфа-банк» , ИНН 7728168971 <br />
                  erid: 2VtzqviGMWf{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформи дебетовую Альфа-карту по уникальной ссылке, соверши
                  первую покупку от 1000 руб. в течение 30 дней с момента
                  оформления карты и получи кэшбэк 1000 руб., а также кэшбэк до
                  5% на 3 категории и до 100% на еще 1 дополнительную категорию.
                  И 1% на всё гарантированно! Акция доступна для новых клиентов
                  (или тех, кто 90 дней назад закрыл счет) из РФ во всех городах
                  присутствия банка и доставки карт. Перечень городов, где
                  осуществляется доставка карты на дом, см. на сайте.
                  Альфа-Карта должна быть у всех! - Бесплатная всегда и без
                  условий - Кэшбэк до 100% на одну категорию, 5% в трёх и 1% на
                  всё - 9% годовых по накопительному Альфа-Счёту - Все переводы
                  и платежи без комиссии С дебетовой Альфа-Картой можно получать
                  повышенный кэшбэк в разных категориях На отпуск • 20% на отели
                  в сервисе Альфа Путешествия • 10% на авиабилеты в сервисе
                  Альфа Путешествия • 5% на ж/д билеты в сервисе Альфа
                  Путешествия На косметику • до 20% в магазинах и на сайте
                  Подружка • 15% в интернет-магазине Yves Rocher • До 10% в
                  магазине и на сайте РИВ ГОШ • До 8% в интернет-магазине
                  Л’Этуаль На покупки для пикника • 5% на сайте Ашан • 20% в
                  сервисе Самокат • 15% в сервисе Магнит Доставка • 15% на сайте
                  Перекрёсток ❗️Кэшбэк до 100% на категорию (выпадает в разделе
                  "Кэшбэк и привилегии"), 5% в трёх выбранных категориях и 1% на
                  всё по Альфа-Карте.{" "}
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/pw53WK?erid=2VtzqviGMWf"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={937386}
      data-ym-id={10262}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_314b83ff019a5462881f78d7e5cd9123.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_70ccbdc99e70a0f63c0c4ea9ee667dc1.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Покупкин</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Покупкин – скидка 400 рублей от 2000 рублей на первые два
                  заказа!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ПРАВИЛЬНЫЕ ПОКУПКИ» , ИНН 5003094197 <br />
                  erid: Kra23sYaW{" "}
                </p>
                <p className="actions-grid-item__details">
                  Скачай приложение и получи скидку 400 рублей на первые два
                  заказа от 2000 рублей! Бесплатная доставка действует для
                  заказов от 999 рублей, для меньшей суммы стоимость составит -
                  99 рублей. Акция доступна в мобильном приложении только для
                  новых клиентов по всей Москве. Ассортимент может быстро
                  заканчиваться, но обновляется каждые 2-3 дня! Если товар
                  закончился в оплаченном заказе, то доставка для вас будет
                  бесплатная (статус обновляется не сразу)!{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="SC27CD"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      SC27CD
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/ieJyek?erid=Kra23sYaW"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={937387}
      data-ym-id={10261}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_6a62cd33baccc55375fca30dc226d57a.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_202b5255c817272fe56a0a3852bde916.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Покупкин</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Покупкин – скидка 300 рублей от 1500 рублей на первые два
                  заказа!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ПРАВИЛЬНЫЕ ПОКУПКИ» , ИНН 5003094197 <br />
                  erid: Kra23cmPY{" "}
                </p>
                <p className="actions-grid-item__details">
                  Скачай приложение и получи скидку 300 рублей на первые два
                  заказа от 1500 рублей! Бесплатная доставка действует для
                  заказов от 999 рублей, для меньшей суммы стоимость составит -
                  99 рублей. Акция доступна в мобильном приложении только для
                  новых клиентов по всей Москве. Ассортимент может быстро
                  заканчиваться, но обновляется каждые 2-3 дня! Если товар
                  закончился в оплаченном заказе, то доставка для вас будет
                  бесплатная (статус обновляется не сразу)!{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="SB29DD"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      SB29DD
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/ReH7np?erid=Kra23cmPY"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={932481}
      data-ym-id={10238}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_726abfb66a5e88ea8ad84705f44a97f7.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_50c82d5a18f41e9d52c5391af02031d8.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">PREMIER</h4>
                      <p className="actions-grid-item__category">
                        Онлайн-сервисы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  PREMIER — целых 30 дней бесплатной подписки!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ПРЕМЬЕР» , ИНН 9702011190 <br />
                  erid: Kra23stjv{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи целых 30 дней бесплатной подписки по уникальному
                  промокоду! Далее подписка будет стоить 299 руб. в месяц. Акция
                  доступна для любых клиентов по всей России, у которых нет
                  активной подписки на момент применения промокода.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="ejrmu5jt"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      ejrmu5jt
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://premier.one/me/code?utm_source=getblogger&utm_medium=cpa_media&utm_campaign=cpa_blog_mar-apr23&utm_content=83018&code=ejrmu5jt&erid=Kra23stjv"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={930391}
      data-ym-id={10225}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_1d315fb886003e57ada9445a925e9f3e.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_6364840c50f19d7120e29e277e1f8fcd.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Яндекс Плюс</h4>
                      <p className="actions-grid-item__category">
                        Онлайн-сервисы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Яндекс Музыка — доступ до конца осени бесплатно!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Яндекс Музыка» , ИНН 9705121040 <br />
                  erid: Kra23kh2d{" "}
                </p>
                <p className="actions-grid-item__details">
                  Зарегистрируйтесь по уникальному промокоду и получите доступ к
                  Яндекс Музыке в подписке Яндекс Плюс до конца осени бесплатно!
                  Акция доступна только для новых пользователей по всей России.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="R6YTLH5L7Y"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      R6YTLH5L7Y
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://plus.yandex.ru/gift?serviceName=cpa_mu_autumn&promoName=cpa_mu_autumn&utm_source=getblogger&utm_medium=paid_performance&utm_content=goal-MU&utm_campaign=MSCAMP-4&utm_term=83018&promocode=R6YTLH5L7Y&erid=Kra23kh2d"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={931920}
      data-ym-id={10245}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_fcb8efb46515512b98348022f5ee7158.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_3be1fa065a9cf792bf27e660df76bdfa.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">KFC</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  KFC — скидка 15% по промокоду на заказ с самовывозом от 399
                  руб.!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ЮНИРЕСТ» , ИНН 7722561551 <br />
                  erid: Kra24BYb7{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформи первый заказ на самовывоз в приложении KFC, примени
                  промокод и получи скидку 15% от 399 руб.! Промокод сработает
                  как у новых клиентов, так и у повторных, которые ранее не
                  делали заказ в приложение на самовывоз. Акция не суммируется с
                  купонами из приложения, а также не распространяется на
                  комбо-наборы, действует по всем городам России, где
                  присутствует ресторан KFC.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="GB3995618"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      GB3995618
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/JeFsUS?erid=Kra24BYb7"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={934921}
      data-ym-id={10255}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_852708bd1f236d5ea4c29f494d3d2d25.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_62005a138978456d2316feed048e30fb.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Яндекс Афиша</h4>
                      <p className="actions-grid-item__category">
                        Онлайн-сервисы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Яндекс.Афиша – скидка 400 руб. на первую покупку билетов от
                  3000 руб.!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Яндекс Музыка» , ИНН 9705121040 <br />
                  erid: Kra23VEso{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку 400 руб. на первую покупку билетов от 3000 руб.
                  по промокоду. Скидка по промокоду применяется на покупку любых
                  билетов, КРОМЕ КИНО. Акция доступна только для новых клиентов
                  по всей России, не суммируется с акциями и спецпредложениями,
                  а также действует в мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="M83296"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      M83296
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/UeGKF8?erid=Kra23VEso"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={931928}
      data-ym-id={10232}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_cd7ef8e64d78b9ab6dd1b1ea82a496e7.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_dd35c81a580c7870f3727ec69e272572.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Много Лосося</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Много Лосося — получи скидку 20% на первый заказ!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Много Лосося» , ИНН 9704003050 <br />
                  erid: Kra23qD7i{" "}
                </p>
                <p className="actions-grid-item__details">
                  Если ты еще никогда не заказывал в Много лосося, то оформи
                  заказ на сумму от 600 рублей и получи скидку 20% по промокоду.
                  Акция доступна новым клиентам в Москве и Санкт-Петербурге.
                  Стандартное время доставки – 60 минут. В отдельных зонах время
                  доставки может быть увеличено до 95 минут – узнать, к какой
                  зоне относится ваш адрес, вы можете в приложении. Минимальная
                  сумма доставки — 600 рублей, но она может варьироваться в
                  зависимости от зоны доставки.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="JFJ3PE"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      JFJ3PE
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/seDypn?erid=Kra23qD7i"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={932494}
      data-ym-id={10252}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_0555180d40495e59c905f2aa14fa30de.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_aebb5e3cdde6499b6ea88de8acbea79e.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">X5 Group</h4>
                      <p className="actions-grid-item__category">
                        Онлайн-сервисы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Пакет X5 — подключите сервис всего за 1 руб на 1 месяц!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Корпоративный центр ИКС 5» , ИНН 7728632689{" "}
                  <br />
                  erid: Kra242ZK1{" "}
                </p>
                <p className="actions-grid-item__details">
                  Первое сентября будет модным! Активируйте сервис «Пакет» за 1
                  рубль и получите промокод на скидку 1500 рублей в KARI. Просто
                  скопируйте промокод из личного кабинета сервиса Пакет, зайдите
                  на сайт kari.ru и введите его в специальном поле. Промокодом
                  можно воспользоваться 1 раз в течение текущего календарного
                  месяца. Хотите получать увеличенный кешбэк в 10 раз за покупку
                  товаров и до 50% на отдельные категории? Активируйте сервис
                  Пакет на месяц за 1 руб. вместо 120 руб! Пользуйтесь приятными
                  преимуществами от покупок в Пятёрочке и Перекрёстке. Крутые
                  призы от сервиса “Пакет” и Ситилинк ждут вас! Прокачайте вашу
                  карту лояльности Х5 Клуба, подключив сервис «Пакет».
                  Зарегистрируйтесь в акции “Чем дольше – тем больше!” и
                  участвуйте в еженедельном розыгрыше призов от сервиса “Пакет”
                  и компании Ситилинк. Акция доступна для новых пользователей по
                  всей России. Кешбэк начисляется баллами на карту лояльности Х5
                  Клуба. Не суммируется с предложениями программы лояльности и
                  акционными товарами.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="SVET9866"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      SVET9866
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/JeF8B2?erid=Kra242ZK1"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={931931}
      data-ym-id={10233}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_8116ae977d83803f048b27fa2a88dcd7.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_f43f45ed420e356a38f7b3f6e7e868b4.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Много Лосося</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Много Лосося — ролл Снежная Калифорния в подарок при заказе от
                  1800 руб.!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Много Лосося» , ИНН 9704003050 <br />
                  erid: Kra23T3BS{" "}
                </p>
                <p className="actions-grid-item__details">
                  Уже делал заказ в Много Лосося? Тогда при заказе от 1 800
                  рублей тебя ждет ролл Снежная Калифорния в подарок. Акция
                  доступна постоянным клиентам в Москве, Московской области и
                  Санкт-Петербурге. Стандартное время доставки – 60 минут. В
                  отдельных зонах время доставки может быть увеличено до 95
                  минут – узнать, к какой зоне относится ваш адрес, вы можете в
                  приложении. Минимальная сумма заказа - 1 800 рублей.
                  Совмещение новостного контента с рекламными публикациями –
                  запрещено.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="QIW5AE"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      QIW5AE
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/IeDcJa?erid=Kra23T3BS"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={930390}
      data-ym-id={10226}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_c2fe476d0d42d38e8a5136acf3670fca.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_1a959f619b0c5175faa4c51df704ee00.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Яндекс Плюс</h4>
                      <p className="actions-grid-item__category">
                        Онлайн-сервисы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Кинопоиск — доступ до конца осени бесплатно!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Кинопоиск» , ИНН 7710688352 <br />
                  erid: Kra23acah{" "}
                </p>
                <p className="actions-grid-item__details">
                  Зарегистрируйтесь по уникальному промокоду и получите доступ к
                  Кинопоиску в подписке Яндекс Плюс до конца осени бесплатно!
                  Акция доступна только для новых пользователей по всей России.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="8GJEY66W7U"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      8GJEY66W7U
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://plus.yandex.ru/gift?serviceName=cpa_kp&promoName=cpa_kp_autumn&utm_source=getblogger&utm_medium=paid_performance&utm_content=goal-KP&utm_campaign=MSCAMP-2&utm_term=83018&promocode=8GJEY66W7U&erid=Kra23acah"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={930393}
      data-ym-id={10224}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_f2f01572209842b04d58f370519a22b2.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_5f7139c3a1598e4927a3cfb3a6cbd3fb.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Яндекс Плюс</h4>
                      <p className="actions-grid-item__category">
                        Онлайн-сервисы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Яндекс Плюс — доступ до конца осени бесплатно!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Яндекс Плюс» , ИНН 9705177420 <br />
                  erid: Kra23oiN1{" "}
                </p>
                <p className="actions-grid-item__details">
                  Зарегистрируйтесь по уникальному промокоду и получите доступ к
                  Яндекс Плюс до конца осени бесплатно! Акция доступна только
                  для новых пользователей по всей России.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="KMCF9FMGBV"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      KMCF9FMGBV
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://plus.yandex.ru/gift?serviceName=cpa_plus&promoName=cpa_pl_autumn&utm_source=getblogger&utm_medium=paid_performance&utm_content=goal-PL&utm_campaign=MSCAMP-62&utm_term=83018&promocode=KMCF9FMGBV&erid=Kra23oiN1"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={931922}
      data-ym-id={10242}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_f62e8472d7086a4273411c9218d12b2b.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_f62534a3f7a102a4f6565b95770470bb.jpeg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">СберМаркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  СберМаркет — Скидка 400 руб. на первый заказ от 1 000 руб. +
                  бесплатная доставка{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ИНСТАМАРТ СЕРВИС» , ИНН 9705118142 <br />
                  erid: Kra23qVQG{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 400 руб. на первый заказ от 1 000 руб. +
                  бесплатная доставка по уникальному промокоду. Скидка
                  суммируется со всеми акциями и скидками на товары! Лучшее
                  время, чтобы совершить свой первый заказ в СберМаркете!
                  Бесплатная доставка любого заказа от любой суммы! Акция
                  доступна для новых клиентов по всей России, кроме Ижевска и
                  Ишима. Доступность сервиса в вашем городе проверяйте в
                  мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="ubp2207s"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      ubp2207s
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://sbermarket.ru/?utm_content=tdyqe&utm_medium=cpa&utm_campaign=ubp2207s&utm_source=getblogger&oid=rs1fv2hzo&wid=tdyqe&statid=6_ubp2207s&sub=ubp2207s&sub2=83018&erid=Kra23qVQG"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={931925}
      data-ym-id={10240}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_3c443887a9c9b8ab6121446368ecbacc.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_0f12023879e911dfc429819c3916a80a.jpeg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">СберМаркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  СберМаркет — Скидка 150 руб. на первый заказ от 400 руб. +
                  бесплатная доставка{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ИНСТАМАРТ СЕРВИС» , ИНН 9705118142 <br />
                  erid: Kra23Sz8t{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 150 руб. на первый заказ от 400 руб. +
                  бесплатная доставка по уникальному промокоду. Скидка
                  суммируется со всеми акциями и скидками на товары! Лучшее
                  время, чтобы совершить свой первый заказ в СберМаркете!
                  Бесплатная доставка любого заказа от любой суммы! Акция
                  доступна для новых клиентов по всей России, кроме Ижевска и
                  Ишима. Доступность сервиса в вашем городе проверяйте в
                  мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="uvho5o3r"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      uvho5o3r
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://sbermarket.ru/?utm_content=tdyqe&utm_medium=cpa&utm_campaign=uvho5o3r&utm_source=getblogger&oid=rs1fv2hzo&wid=tdyqe&statid=6_uvho5o3r&sub=uvho5o3r&sub2=83018&erid=Kra23Sz8t"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={931923}
      data-ym-id={10241}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_0896adb24f41c8ed952bf0d443da1bef.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_9ef986c6582a95a2db8e85582f7756ec.jpeg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">СберМаркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  СберМаркет — Скидка 650 руб. на первый заказ от 1 500 руб. +
                  бесплатная доставка{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ИНСТАМАРТ СЕРВИС» , ИНН 9705118142 <br />
                  erid: Kra23cj6t{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 650 руб. на первый заказ от 1 500 руб. +
                  бесплатная доставка по уникальному промокоду. Скидка
                  суммируется со всеми акциями и скидками на товары! Лучшее
                  время, чтобы совершить свой первый заказ в СберМаркете!
                  Бесплатная доставка любого заказа от любой суммы! Акция
                  доступна для новых клиентов по всей России, кроме Ижевска и
                  Ишима. Доступность сервиса в вашем городе проверяйте в
                  мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="inye2m1r"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      inye2m1r
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://sbermarket.ru/?utm_content=tdyqe&utm_medium=cpa&utm_campaign=inye2m1r&utm_source=getblogger&oid=rs1fv2hzo&wid=tdyqe&statid=6_inye2m1r&sub=inye2m1r&sub2=83018&erid=Kra23cj6t"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={931927}
      data-ym-id={10239}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_ff13d01299b131faeb6d83b9e15585ae.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_87eb82700c72f2237a8515a6d134dd7f.jpeg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">СберМаркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  СберМаркет — Скидка 800 руб. на первый заказ от 2 000 руб. +
                  бесплатная доставка!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ИНСТАМАРТ СЕРВИС» , ИНН 9705118142 <br />
                  erid: Kra23WLxC{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 800 руб. на первый заказ от 2 000 руб. +
                  бесплатная доставка по уникальному промокоду. Скидка
                  суммируется со всеми акциями и скидками на товары! Лучшее
                  время, чтобы совершить свой первый заказ в СберМаркете!
                  Бесплатная доставка любого заказа от любой суммы! Акция
                  доступна для новых клиентов по всей России, кроме Ижевска и
                  Ишима. Доступность сервиса в вашем городе проверяйте в
                  мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="um5uf95j"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      um5uf95j
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://sbermarket.ru/?utm_content=tdyqe&utm_medium=cpa&utm_campaign=um5uf95j&utm_source=getblogger&oid=rs1fv2hzo&wid=tdyqe&statid=6_um5uf95j&sub=um5uf95j&sub2=83018&erid=Kra23WLxC"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={931924}
      data-ym-id={10243}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_1fddfd10a58bbb001a60cde335bf546a.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_fa5ef6979d89b86f5f86ef7f49c119bf.jpeg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">СберМаркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  СберМаркет — Скидка до 30% на первый заказ от 2000 руб. +
                  бесплатная доставка{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ИНСТАМАРТ СЕРВИС» , ИНН 9705118142 <br />
                  erid: Kra248ctL{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку до 30% на первый заказ от 2 000 руб. +
                  бесплатная доставка по уникальному промокоду. Скидка
                  суммируется со всеми акциями и скидками на товары!
                  Максимальный размер скидки - 1 000 руб. Лучшее время, чтобы
                  совершить свой первый заказ в СберМаркете! Бесплатная доставка
                  любого заказа от любой суммы! Акция доступна для новых
                  клиентов по всей России, кроме Ижевска и Ишима. Доступность
                  сервиса в вашем городе проверяйте в мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="icna6ges"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      icna6ges
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://sbermarket.ru/?utm_content=tdyqe&utm_medium=cpa&utm_campaign=icna6ges&utm_source=getblogger&oid=rs1fv2hzo&wid=tdyqe&statid=6_icna6ges&sub=icna6ges&sub2=83018&erid=Kra248ctL"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={898324}
      data-ym-id={10164}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_fd451dd058def6d2ed786a74502aef33.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_85413ab1044565503da2f774bc7b0a17.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">
                        Магнит Доставка
                      </h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Магнит Доставка — скидка 30% на первый заказ от 1000 руб!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Тандер» , ИНН 2310031475 <br />
                  erid: 2Vtzqx9HfHy{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку 30% на первый заказ от 1000 руб из магазинов
                  Магнит Косметик, Магнит Экспресс и Гипермаркет Магнит в
                  мобильном приложении и на веб-сайте Магнит Доставка по
                  уникальному промокоду! Сервис может самостоятельно определять
                  минимальную сумму заказа в зависимости от зоны доставки,
                  повышенного спроса и т.д. Акция суммируется с другими скидками
                  и спецпредложениями в приложении!.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="HOTDAY94193"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      HOTDAY94193
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/yenmCa?erid=2Vtzqx9HfHy"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={922885}
      data-ym-id={10211}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_b835922dbe037d1cb0e215ea720f8113.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_ff29dd1a619235daa7a76383ca33805b.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Перекрёсток</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 10 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Перекрёсток и онлайн-кинотеатр PREMIER — скидка 25% на новый
                  заказ от 2000 руб. и подписка на 50 дней в подарок!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Торговый дом «ПЕРЕКРЁСТОК» , ИНН 7728029110 <br />
                  erid: 2VtzquiTB19{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформите свой первый заказ на сайте или в приложении
                  “Перекрёсток” с промокодом на скидку 25% от 2000 руб. до
                  10.09.2023. Получите sms-сообщение с промокодом на подписку на
                  онлайн-кинотеатр PREMIER на 50 дней + 10% скидку на первое
                  продление до 17 сентября 2023г на номер, который вы указывали
                  при оформлении заказа! Акция действует с 25.08 по 10.09 для
                  новых пользователей и не суммируется со скидками и с товарами
                  со знаком “Низкая цена”. Зону доставки можно проверить на
                  сайте или в мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="UUX53S"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      UUX53S
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/PeOJu4?erid=2VtzquiTB19"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={922886}
      data-ym-id={10210}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_6c681fd026d5acc0adea6f746a15f1fd.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_ba4a8c65fb83b4020e6969bf73a0578a.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Перекрёсток</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 10 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Перекрёсток и онлайн-кинотеатр PREMIER — скидка 20% на новый
                  заказ и подписка на 50 дней в подарок!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Торговый дом «ПЕРЕКРЁСТОК» , ИНН 7728029110 <br />
                  erid: 2VtzqugyBio{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформите свой первый заказ на сайте или в приложении
                  “Перекрёсток” с промокодом на скидку 20% от любой суммы до
                  10.09.2023. Получите sms-сообщение с промокодом на подписку на
                  онлайн-кинотеатр PREMIER на 50 дней + 10% скидку на первое
                  продление до 17 сентября 2023г на номер, который вы указывали
                  при оформлении заказа! Акция действует с 25.08 по 10.09 для
                  новых пользователей и не суммируется со скидками и с товарами
                  со знаком “Низкая цена”. Зону доставки можно проверить на
                  сайте или в мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="BK52NT"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      BK52NT
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/MeOJio?erid=2VtzqugyBio"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={922887}
      data-ym-id={10209}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_0dca1e61ce5e04e8af1f33df25162d80.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_24c0f6a686e7f08c29fcfa1fbe4c61bb.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Перекрёсток</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 10 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Перекрёсток и онлайн-кинотеатр PREMIER — скидка 15% на первые
                  3 заказа и подписка на 50 дней в подарок!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Торговый дом «ПЕРЕКРЁСТОК» , ИНН 7728029110 <br />
                  erid: 2VtzqufVCST{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформите свой первый заказ на сайте или в приложении
                  “Перекрёсток” с промокодом на скидку 15% на первые три заказа
                  от любой суммы до 10 сентября 2023г. Получите sms-сообщение с
                  промокодом на подписку на онлайн-кинотеатр PREMIER на 50 дней
                  + 10% скидку на первое продление до 17 сентября 2023г на
                  номер, который вы указывали при оформлении заказа! Акция
                  действует с 25.08 по 10.09 для новых пользователей и не
                  суммируется со скидками и с товарами со знаком “Низкая цена”.
                  Зону доставки можно проверить на сайте или в мобильном
                  приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="ZDLHXT"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      ZDLHXT
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/veOJoB?erid=2VtzqufVCST"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={925912}
      data-ym-id={10217}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_322e86eaba403b49e5f577dcbeed5962.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_4a566c4993976aac3780ba9a2a929493.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">
                        Яндекс Путешествия
                      </h4>
                      <p className="actions-grid-item__category">Путешествия</p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 14 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Яндекс Путешествия — Получи скидку до 5000 руб на первое
                  бронирование отеля в мобильном приложении!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Яндекс.Вертикали» , ИНН 7704340327 <br />
                  erid: BRBCaQT7cqRmJqUoDxByjbboqtGb2qF{" "}
                </p>
                <p className="actions-grid-item__details">
                  Забронируй отель в мобильном приложении Яндекс Путешествия на
                  любую дату от 10 000 руб и получи скидку 12% по промокоду.
                  Максимальный размер скидки - 5 000 руб. Акция доступна только
                  для новых пользователей при бронировании отеля в мобильном
                  приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="GB-NW5-25FH6"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      GB-NW5-25FH6
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://redirect.appmetrica.yandex.com/serve/172265109215861132?afpub_id=getblogger&site_id=83018&creative_id=GB-NW5-25FH6&erid=BRBCaQT7cqRmJqUoDxByjbboqtGb2qF"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={870867}
      data-ym-id={10101}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_9d8c08b58f614b82674298c574e65d92.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_73229c3fecd634749faa4c3d92d1e24b.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">
                        Яндекс Путешествия
                      </h4>
                      <p className="actions-grid-item__category">Путешествия</p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Яндекс Путешествия — получи скидку 15% на первое бронирование
                  отеля!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Яндекс.Вертикали» , ИНН 7704340327 <br />
                  erid: BRBCaQT7cqRmJqUoDx8hz2aXc14PE14{" "}
                </p>
                <p className="actions-grid-item__details">
                  Забронируй отель напрямую на Яндекс Путешествиях на любую дату
                  и получи скидку 15% на первое бронирование. Максимальная
                  скидка по промокоду - 1 000 руб. Акция доступна только новым
                  пользователям, которые ранее не совершали бронирований на
                  сервисе.
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="GB-NEW-BSA4K"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      GB-NEW-BSA4K
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/weAdoa?erid=BRBCaQT7cqRmJqUoDx8hz2aXc14PE14"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={871036}
      data-ym-id={10102}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_80cbf8da1d0a2da1f9ad8fd866e66ac2.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_fd8cf17ff109f2207b50f9f282d2be4b.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">
                        Яндекс Путешествия
                      </h4>
                      <p className="actions-grid-item__category">Путешествия</p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Яндекс Путешествия — получи скидку 12% на повторное
                  бронирование отеля!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Яндекс.Вертикали» , ИНН 7704340327 <br />
                  erid: BRBCaQT7cqRmJqUoDx8hzCHCcouK8UD{" "}
                </p>
                <p className="actions-grid-item__details">
                  Забронируй отель напрямую на Яндекс Путешествиях на любую дату
                  и получи скидку 12% на любое бронирование. Максимальная скидка
                  по промокоду - 1 000 руб. Акция доступна для всех клиентов во
                  всех городах и странах присутствия сервиса.
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="GB-OLD-OQAZ5"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      GB-OLD-OQAZ5
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/CeAcTl?erid=BRBCaQT7cqRmJqUoDx8hzCHCcouK8UD"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={911727}
      data-ym-id={10190}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_483bb6415fbf8424b1d99206e7190d39.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_711bb34b55fd6a7f49c03aae1621630a.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">VK Музыка</h4>
                      <p className="actions-grid-item__category">
                        Онлайн-сервисы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  VK Музыка — 30 дней подписки на двоих бесплатно!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «В Контакте» , ИНН 7842349892 <br />
                  erid: 2VtzqxaVT5q{" "}
                </p>
                <p className="actions-grid-item__details">
                  Переходи по ссылке, оформляй бесплатную подписку на VK Музыку
                  на 30 дней по промокоду и подключи друга! Далее подписка будет
                  стоить 198 руб./мес. за двоих, (99 руб./мес за каждого). Как
                  добавить к подписке друга после применения промокода: —
                  Переходи в личный кабинет на сайте VK Музыка и добавляй
                  участника в разделе “Моя подписка” или на сайте и в приложении
                  Вконтакте в разделе “Сервисы” выбери VK Музыку и переходи в
                  раздел “Моя подписка”, там ты сможешь добавить второго
                  участника. В участники можно добавить любого пользователя,
                  который добавлен в друзья, а также у которого нет активной
                  подписки на данный момент. Акция доступна для пользователей
                  Вконтакте, у которых никогда не было подписки на VK Музыку или
                  она закончилась более 1 месяца назад.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="30HACUPON"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      30HACUPON
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/9eYros?erid=2VtzqxaVT5q"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={929375}
      data-ym-id={10231}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_317afe7bf7e75eaa8ad901fcb1c1e5ce.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_c96e90e855c99a42e65c2f49ae0fc2ee.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">ГЛОБУС</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  ГЛОБУС — скидка 10% на повторный заказ от 4000 руб.!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Гиперглобус» , ИНН 7743543761 <br />
                  erid: 2VtzqubMPy9{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку 10% на повторный заказ от 4000 руб.! Скидка не
                  суммируется со всеми акциями и спецпредложениями и не
                  действует на бытовую технику, электронику и алкоголь. Акция
                  доступна для текущих клиентов из городов: Москва и МО на
                  сайте.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="G251B-19208"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      G251B-19208
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/8eKjNH?erid=2VtzqubMPy9"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={853257}
      data-ym-id={10077}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_ca8d6b8283e6f562e47df6b17fe4f33e.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_573dfeb9b397e773d42b4da67f936d62.webp)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Уралсиб</h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 22 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  «Уралсиб» - Выиграйте подарочный сертификат Яндекс Маркет на
                  500 руб + 1 000 приветственных бонусных рублей!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ПАО «БАНК УРАЛСИБ» , ИНН 0274062111 <br />
                  erid: 2VtzqvmEL5M{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформите дебетовую карту “Прибыль”, совершите покупку от 500
                  руб до 22.09.2023 и получите шанс выиграть сертификат Яндекс
                  Маркета на сумму 500 руб. Дополнительно вам будут начислены 1
                  000 приветственных бонусов. Предложение доступно для новых
                  клиентов банка. Пользуйтесь приятными преимуществами карты
                  «Прибыль»: — 13% годовых на ежедневный остаток. — Выгодный
                  кешбэк до 3% рублями. — Бесплатное обслуживание при тратах от
                  10 000 ₽/мес.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="YAGB146"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      YAGB146
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/XeqZgk?erid=2VtzqvmEL5M"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={910791}
      data-ym-id={10187}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_e808c551ae807ec073c7dc01d3258630.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_92f1dec15f091ad1788b5914cbe30499.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">ГЛОБУС</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 16 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  ГЛОБУС — скидка 20% на первые два заказа от 3 500 руб.!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Гиперглобус» , ИНН 7743543761 <br />
                  erid: 2VtzqxXXUX9{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку 20% на первые два заказа от 3 500 руб.! Скидка
                  не суммируется со всеми акциями и спецпредложениями и не
                  действует на бытовую технику, электронику и алкоголь. Акция
                  доступна для новых клиентов из городов: Москва и МО на сайте.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="G247B-06120"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      G247B-06120
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/3eLpoR?erid=2VtzqxXXUX9"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={925080}
      data-ym-id={10214}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_f503d84c583109e2e2c225193bbc0abe.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_426366cb526d677e2bf69a78906a8a5d.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">START</h4>
                      <p className="actions-grid-item__category">
                        Онлайн-сервисы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  START — 30 дней подписки по промокоду!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Старт.Ру» , ИНН 7728374780 <br />
                  erid: 2VtzqujwAHV{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи 30 дней подписки на онлайн-кинотеатрe START и доступ к
                  эксклюзивным премьерам по уникальному промокоду. Акция
                  доступна для новых пользователей в РФ.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="gb18542"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      gb18542
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/deO6eF?erid=2VtzqujwAHV"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={932493}
      data-ym-id={10244}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_45cfdc797c7e88b78ab59f9b97ff234a.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_954757517dde88176d70cea35c4e2d50.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Flor2u</h4>
                      <p className="actions-grid-item__category" />
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Flor2u — получи скидку 15% на повторный заказ в мобильном
                  приложении!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ИП Агафонова , ИНН 772997055554 <br />
                  erid: Kra23zaAf{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку -15% на повторный заказ по уникальному промокоду
                  в мобильном приложении. Акция доступна для постоянных
                  клиентов, проживающих в РФ, суммируется с остальными
                  предложениями. Полный перечень городов уточняйте на сайте или
                  в мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="SEGBA99A66"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      SEGBA99A66
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/heKo1R?erid=Kra23zaAf"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={874159}
      data-ym-id={10111}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_a4fd3e49feb350ac0b2fad46c4fe0043.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_5c5c299adf46b368d57dcbedf40e31df.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">
                        Перекрёсток Vprok
                      </h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Перекрёсток Vprok — Скидка 2 400 руб. на первые 3 заказа от 3
                  500 руб. + бесплатная доставка!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Онлайн-Гипермаркет» , ИНН 9722004963 <br />
                  erid: 2Vtzqw3YCB9{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 800 руб. на каждый из первых 3 заказов от 3
                  500 руб. на сайте и в приложении с бесплатной доставкой по
                  уникальному промокоду. Закажите продукты и необходимые товары
                  со скидкой на дачу, домой или в офис! Акция доступна для
                  клиентов из Москвы, Московской области, Санкт-Петербурга,
                  Ленинградской области, Рязани, Тулы, Твери, Владимирской
                  области, Калужской области. Промокоды действуют до 30.09, не
                  распространяются на товары со скидками и товары-исключения{" "}
                  <a
                    href="http://vprok.ru/s-exc"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    http://vprok.ru/s-exc
                  </a>{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="BLACK800"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      BLACK800
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/1eSgFM?erid=2Vtzqw3YCB9"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={925917}
      data-ym-id={10218}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_7712edf68075ae021f6327d2b383b457.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_43091ce32a908d91ea3f92bdc6767a29.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">befree</h4>
                      <p className="actions-grid-item__category">Мода</p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 4 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Befree — 15% скидка на все + 10% при оплате онлайн!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Мэлон Фэшн Групп» , ИНН 7839326623 <br />
                  erid: 2VtzqukJzjq{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку 15% на все без минимальной суммы заказа на сайте
                  или в приложении. При оплате онлайн дополнительно можно
                  получить скидку 10%. Суммируется с распродажей до 80% на
                  выделенный ассортимент! Акция доступна для всех клиентов по
                  всей России и суммируется со всеми акциями и спецпредложениями
                  на сайте. Бесплатная доставка при заказе от 2000 рублей.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="PWNCB3GB"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      PWNCB3GB
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/LePDI9?erid=2VtzqukJzjq"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={925924}
      data-ym-id={10219}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_586de4b9dce7624b5773a7a34ab6c221.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_e2b6d7f249158d7cf605ad47a283795f.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">befree</h4>
                      <p className="actions-grid-item__category">Мода</p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 4 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Befree — 25% скидка на новую коллекцию + 10% при оплате
                  онлайн!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Мэлон Фэшн Групп» , ИНН 7839326623 <br />
                  erid: 2Vtzqvk9Bh9{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку 25% на новую коллекцию без минимальной суммы
                  заказа на сайте или в приложении. При оплате онлайн
                  дополнительно можно получить скидку 10%. Суммируется с
                  распродажей до 80% на выделенный ассортимент! Акция
                  суммируется со всеми акциями и спецпредложениями, доступна для
                  всех клиентов по всей России. Бесплатная доставка при заказе
                  от 2000 рублей.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="301F7UGB"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      301F7UGB
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/peP2y6?erid=2Vtzqvk9Bh9"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={921211}
      data-ym-id={10204}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_428ec42834f6bb7cd3d009060fc52556.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_07c33f32d6d0e4896a5b0a97e74018e7.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Магнолия</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Магнолия – скидка 20% по купону при покупке от 600р!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ЗАО «Т И К ПРОДУКТЫ» , ИНН 7731162754 <br />
                  erid: 2Vtzqub3EbR{" "}
                </p>
                <p className="actions-grid-item__details">
                  Сфотографируй купон, предъяви его на кассе и получи скидку 20%
                  при покупке от 600р! Акция распространяется на все товары с
                  белыми ценниками, кроме акционной, алкогольной, табачной
                  продукции. Принять участие в акции можно во всех магазинах
                  Москвы и Московской области, кроме магазина по адресу: 36,
                  микрорайон 1 Мая, Балашиха Список всех адресов по ссылке:{" "}
                  <a
                    href="https://shop.mgnl.ru/contacts/stores/"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    https://shop.mgnl.ru/contacts/stores/
                  </a>{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text={999814800000086}
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      999814800000086
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/YeI1JH?erid=2Vtzqub3EbR"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={886513}
      data-ym-id={10141}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_a90591ccebf6c29f84bf1f6fb2f4d95c.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_ca70a1e415656bc0143e2237acbb97b3.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Яндекс Плюс</h4>
                      <p className="actions-grid-item__category">
                        Онлайн-сервисы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Яндекс Плюс — 30 дней бесплатного доступа с опцией Букмейт!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Яндекс Музыка» , ИНН 9705121040 <br />
                  erid: BRBCaQT7cqRmJqUoDx8kwJfKriFscy8{" "}
                </p>
                <p className="actions-grid-item__details">
                  Зарегистрируйтесь по уникальному промокоду и получите
                  бесплатный доступ к подписке Яндекс Плюс с опцией Букмейт на
                  целых 30 дней! Активация триала Яндекс Плюс доступна для новых
                  пользователей по всей России. Пользователи, у которых уже есть
                  подписка, могут активировать опцию Букмейт.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="Y62MFWNJ4G"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      Y62MFWNJ4G
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/Kezp0A?erid=BRBCaQT7cqRmJqUoDx8kwJfKriFscy8"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={697579}
      data-ym-id={9575}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_a2094f17a678113b7c712663205135b1.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_38cdc8b3a07aeee3e62c1bdd25fac134.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Яндекс Плюс</h4>
                      <p className="actions-grid-item__category">
                        Дом и ремонт
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Яндекс Станции — оформите по подписке Яндекс Плюс!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Яндекс Плюс» , ИНН 9705177420 <br />
                  erid: 3MtFQRkqfB2jnmPWveqnAvqHq12Q96{" "}
                </p>
                <p className="actions-grid-item__details">
                  Переходите по уникальной ссылке и получите по подписке Яндекс
                  Плюс любой Яндекс Девайс: Станция Макс от 1399 руб. в месяц
                  Станция Второго поколения от 1049 руб. в месяц Станция Мини
                  2.0 (без часов) от 579 руб. в месяц Станция Мини 2.1 (с
                  часами) от 600 руб. в месяц Станция Лайт от 489 руб. в месяц
                  Модуль с Яндекс.ТВ от 590 руб. в месяц Акция доступна для всех
                  пользователей по всей России. Заявку на получение Яндекс
                  Станции может подать пользователь, который активно пользуется
                  сервисами Яндекса. Для тех, у кого уже есть станция по
                  подписке, стоимость новой будет еще ниже! Новая Станция в
                  аренду по подписке Яндекс Плюс Оформляя устройство в аренду по
                  подписке, вы получаете его сразу, а оплачиваете частями —
                  ежемесячно в течение 1 года или 3-х лет. Подписка включает все
                  преимущества Яндекс Плюса для вас и 3-х ваших близких с
                  персональными рекомендациями и аккаунтами для каждого.{" "}
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/twyFuO?erid=3MtFQRkqfB2jnmPWveqnAvqHq12Q96"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={918620}
      data-ym-id={10202}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_740cf5e425c9866c8e74eab455c9e71b.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_b5dde5e868cbcfeb77de4f3925d19e50.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Ralf Ringer</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Ralf Ringer – дополнительная скидка 10% в интернет-магазине
                  для постоянных покупателей!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «РАЛЬФ РИНГЕР РИТЕЙЛ» , ИНН 7718953690 <br />
                  erid: 2VtzquWawGT{" "}
                </p>
                <p className="actions-grid-item__details">
                  Готовьтесь к осеннему сезону вместе с Ralf Ringer максимально
                  выгодно! Оформляйте заказ на сайте и получите дополнительную
                  скидку 10% по промокоду! Огромный ассортимент одежды, обуви,
                  сумок и аксессуаров. Скидка по промокоду суммируется со
                  скидками и спецпредложениями, но не суммируется с бонусами и
                  акцией “-15% на второй товар” А чтобы покупки были ещё
                  выгоднее и удобнее: — Оплата любого заказа частями с помощью
                  сервиса «Долями» — При участии в программе лояльности Клуб
                  RALF RINGER получайте бонусы с каждой покупки: 7% от товаров
                  по полной цене и 3,5% от товаров со скидкой. — 500 бонусов на
                  карту лояльности на следующую покупку при оплате заказа СБП от
                  1500р. — Бонусами можно оплатить до 30% от суммы товаров, даже
                  со скидкой. 1 бонус = 1 рубль — Бесплатная доставка при
                  покупке от 3000р с возможностью примерки и частичного выкупа
                  заказа.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="HACUPON10"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      HACUPON10
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/HeOmRr?erid=2VtzquWawGT"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={802379}
      data-ym-id={9927}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_09c2b074fce11134ba994b63f7fdb931.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_874f8bff03a494527004d55f8babde0f.webp)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Уралсиб</h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Уралсиб — Год подписки на Arzamas в подарок по дебетовой карте
                  «Прибыль»!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ПАО «БАНК УРАЛСИБ» , ИНН 0274062111 <br />
                  erid: 2VtzqvCcbsm{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформите карту “Прибыль” и совершите транзакции на сумму от
                  500 рублей, в течение 30 дней с момента получения карты, и
                  получите промокод на годовую подписку Arzamas. Предложение
                  действует только для новых клиентов Банка до 30.11.2023.
                  Пользуйтесь приятными преимуществами карты «Прибыль»: — 13%
                  годовых на ежедневный остаток. — Выгодный кешбэк до 3%
                  рублями. — Бесплатное обслуживание при тратах от 10 000 ₽/мес.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="UGB065"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      UGB065
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/8wKF1x?erid=2VtzqvCcbsm"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={918618}
      data-ym-id={10205}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_9403d3f36430211b24bf29b931bdf523.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_cdd50688cc0aee30a5088cc8365a0228.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Ralf Ringer</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Ralf Ringer – дополнительная скидка 20% на первый заказ в
                  интернет-магазине!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «РАЛЬФ РИНГЕР РИТЕЙЛ» , ИНН 7718953690 <br />
                  erid: 2VtzquY4vYo{" "}
                </p>
                <p className="actions-grid-item__details">
                  Готовьтесь к осеннему сезону вместе с Ralf Ringer максимально
                  выгодно! Оформите первый заказ на сайте и получите
                  дополнительную скидку 20% по промокоду! Огромный ассортимент
                  одежды, обуви, сумок и аксессуаров. Скидка по промокоду
                  суммируется со скидками и спецпредложениями, не суммируется с
                  бонусами и акцией “-15% на второй товар” А чтобы покупки были
                  ещё выгоднее и удобнее: — Оплата любого заказа частями с
                  помощью сервиса «Долями» — При участии в программе лояльности
                  Клуб RALF RINGER получайте бонусы с каждой покупки: 7% от
                  товаров по полной цене и 3,5% от товаров со скидкой. — 500
                  бонусов на карту лояльности на следующую покупку при оплате
                  заказа СБП от 1500р. — Бонусами можно оплатить до 30% от суммы
                  товаров, даже со скидкой. 1 бонус = 1 рубль — Бесплатная
                  доставка при покупке от 3000р с возможностью примерки и
                  частичного выкупа заказа.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="HACUPON20"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      HACUPON20
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/8eObVk?erid=2VtzquY4vYo"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={916280}
      data-ym-id={10200}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_5b00b6b3bc190d0c4cbffaaef331c793.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_73f57a6f958bf3de918ae2950aa7bc04.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">TVIL.RU</h4>
                      <p className="actions-grid-item__category">Путешествия</p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Твил — получите 30 000 бонусов на первое бронирование!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Твил Софт» , ИНН 9731077781 <br />
                  erid: 2VtzquWbGkP{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформите бронирование по уникальному промокоду и получите
                  целых 30 000 бонусов на ваши путешествия! Выбирайте отель,
                  квартиру, дом, а также другие варианты размещений. Акция
                  доступна только для новых клиентов по всей России, действует
                  на сайте. Бонусами можно оплатить не более 10% от суммы чека
                  (за 1 бронирование). Остаток бонусов будет доступен вам и на
                  другие путешествия в течение года. Суммируется с другими
                  предложениями.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="DTADM7"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      DTADM7
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/6eUq6W?erid=2VtzquWbGkP"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={802381}
      data-ym-id={9929}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_e190940f168526f420d0894e706cbef0.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_e1c15054013f1cc768470a8f34ec722a.webp)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Уралсиб</h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Уралсиб — оформи дебетовую карту и получи подписку Яндекс
                  Плюс!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ПАО «БАНК УРАЛСИБ» , ИНН 0274062111 <br />
                  erid: 2VtzqvFaaST{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформи дебетовую карту до 30.11.2023 по ссылке и получи до 13%
                  на остаток и до 3% на все покупки. В качестве бонуса для новых
                  клиентов — подписка на Яндекс плюс Мульти! Акция доступна для
                  всех граждан РФ, которые оформят карту на территории
                  Российской Федерации в регионах присутствия Банка.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="UPL120"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      UPL120
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/3wKgVV?erid=2VtzqvFaaST"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={912536}
      data-ym-id={10191}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_f3bc2e5671568b06c429a377bea90797.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_24e7be40aca8c3e300c5a99bba62f50c.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Otello</h4>
                      <p className="actions-grid-item__category">Путешествия</p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Otello – скидка 10% на первое бронирование отелей для
                  путешествий без ограничения по сумме скидки!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ДубльГИС» , ИНН 5405276278 <br />
                  erid: 2VtzqxbySNB{" "}
                </p>
                <p className="actions-grid-item__details">
                  Регистрируйтесь по ссылке в онлайн-сервисе Otello и получите
                  скидку 10% в мобильном приложении или на сайте на первое
                  бронирование отелей, хостелов и апартаментов для путешествий
                  по России! А также: • Оплачивайте до 99% стоимости бонусами
                  СберСпасибо • Получайте до 10% Кешбэк бонусами СберСпасибо:
                  10% при первом бронировании, 5% при повторных Скидка 10%
                  суммируется со всеми акциями и предложениями, предоставляется
                  в мобильном приложении или на сайте, не имеет ограничения по
                  сумме скидки. Акция доступна для клиентов 18+ из РФ.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="HACUPON10"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      HACUPON10
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/2ePzC1?erid=2VtzqxbySNB"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={908993}
      data-ym-id={10181}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_2ce9f7e14cb0b9224e4c219224aa2766.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_9d25cd35ca0b83d59b80765f8fddcf8d.jpeg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">СберМаркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 10 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  СберМаркет — Скидка 300 руб. от 1 500 руб. на повторный заказ
                  в СберМаркете в Аптеках + бесплатная доставка!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ИНСТАМАРТ СЕРВИС» , ИНН 9705118142 <br />
                  erid: 2VtzqxQ7Y7R{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 300 руб. от 1 500 руб. на повторный заказ в
                  СберМаркете в Аптеках + бесплатная доставка по уникальному
                  промокоду. Скидка суммируется со всеми акциями и скидками на
                  товары! Лучшее время, чтобы совершить свой первый заказ в
                  СберМаркете! Бесплатная доставка любого заказа от любой суммы!
                  Акция доступна для текущих клиентов по всей России, кроме
                  Ижевска и Ишима. Доступность сервиса в вашем городе проверяйте
                  в мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="4w08wzuz"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      4w08wzuz
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/meEDfO?erid=2VtzqxQ7Y7R"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={910801}
      data-ym-id={10185}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_4ac8e9920532c403b18b835a2885ba67.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_afd7cb70fbbcde00ec3086c02c9be297.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">ГЛОБУС</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 16 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  ГЛОБУС — бесплатная доставка для всех клиентов на один заказ!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Гиперглобус» , ИНН 7743543761 <br />
                  erid: 2VtzqxRbXPm{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформи один заказ от 2500 рублей на сайте по уникальному
                  промокоду и получи бесплатную доставку! Акция доступна для
                  новых и старых клиентов в Москве и МО на сайте.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="G248B-93257"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      G248B-93257
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/beK6pW?erid=2VtzqxRbXPm"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={802392}
      data-ym-id={9928}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_20ca2c5e8af8133ba9dbbce093fbf1be.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_ea6875a172fe74c7a902057a3528fb21.webp)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Уралсиб</h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Уралсиб — оформи дебетовую карту и получи до 1 000 бонусных
                  рублей!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ПАО «БАНК УРАЛСИБ» , ИНН 0274062111 <br />
                  erid: 2VtzqvE6bA7{" "}
                </p>
                <p className="actions-grid-item__details">
                  Сыграй и получи 1 000 бонусных рублей на дебетовую карту
                  «Прибыль»! Ими можно компенсировать покупки, а еще карта дает
                  13% на остаток каждый месяц. Правила игры: 1. Главное — это
                  точность. Необходимо правильно закрасить части фигур. 2. Всего
                  в игре 5 изображений. После хода автоматически появляется
                  следующее. 3. Чтобы получить бонусы, закрась правильно 1 и
                  больше фигур. Срок проведения акции до 30 сентября 2023 года.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="UDK019"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      UDK019
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/TwKQiB?erid=2VtzqvE6bA7"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={901516}
      data-ym-id={10172}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_e23fbb136633c50b81e2a5f6438ad154.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_27264d6579c2333b035daac50f496315.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">ИЛЬ ДЕ БОТЭ</h4>
                      <p className="actions-grid-item__category">
                        Красота и здоровье
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 11 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  ИЛЬ ДЕ БОТЭ – скидка 1500 руб. на первые и повторные покупки
                  от 4500 руб.!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «ИЛЬ ДЕ БОТЭ» , ИНН 7707061530 <br />
                  erid: 2VtzqxDjd91{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку 1500 руб. на покупку товаров от 4500 руб. по
                  промокоду при заказе на сайте или в приложении ИЛЬ ДЕ БОТЭ.
                  Акция доступна для новых и постоянных клиентов. Промокод
                  суммируется с другими предложениями и скидками до 25% по карте
                  лояльности. Предложение не действует на бренды-исключения:
                  АRMANI, Chanel, Christian Dior, Elemis, JO MALONE, KILIAN, LA
                  MER, LA PRAIRIE, MAC, TOM FORD, Guerlain, Loewe, PAT MC GRATH,
                  URBAN DECAY, Viseart, Xlash Cosmetics, ESCENTRIC MOLECULES,
                  BYREDO, MANCERA, VILHELM PARFUMERIE, CREED, JULIETTE HAS A
                  GUN, MEMO, ORMONDE JAYNE, DIPTYQUE, THE HOUSE OF OUD,
                  COMPAGNIE DE PROVENCE, FLORAIKU, CLIVE CHRISTIAN, ATELIER DES
                  ORS, SHAIK, MORESQUE, GEZA SCHOEN, HERMETICA, ROJA PARFUMS, SA
                  AL&amp;CO, PARLE MOI DE PARFUM, MAISON CRIVELLI, DAVID
                  MALLETT, PHILIP B, GOLDFIELD &amp; BANKS AUSTRAL, HOBE PERGH,
                  ELIZABETA ZEFI, L:A BRUKET, MILLER ET BERTAUX, DR LEVY
                  SWITZERLAND, MAISON REBATCHI, JACQUES ZOLTY, NARCYSS, PAOMA,
                  HFC, INITIO, JARDIN DE PARFUMS, KORLOFF, LA MAISON DE LA
                  VANILLE, LOVE TEA ART, MONTALE, SIGNATURE BY SILLAGE D'ORIENT,
                  THE WOODS COLLECTION, THOMAS KOSMALA PARIS.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="E29R53"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      E29R53
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/WeQq5E?erid=2VtzqxDjd91"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={927337}
      data-ym-id={10223}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_8fcd1c510546ae3c7eb4e78b21f6f402.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_89e459bc892073bd14cc13d15c104c21.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Бетховен</h4>
                      <p className="actions-grid-item__category">
                        Товары для животных
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 11 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Бетховен — скидка 20% Pro Cat и Pro Dog в интернет-магазине
                  Бетховен!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Пет Ритейл» , ИНН 7726650932 <br />
                  erid: 2VtzqxiABSf{" "}
                </p>
                <p className="actions-grid-item__details">
                  Как выразите любовь к своему питомцу? Просто купите всё, что
                  ему нужно. Бетховен дарит скидку- 20% на весь ассортимент Pro
                  Cat и Pro Dog. Предложение действует в интернет-магазине!
                  Акция доступна для всех клиентов на сайте по всей России. Не
                  суммируется с другими предложениями. Присутствие магазина в
                  вашем городе уточняйте на сайте. Бесплатная доставка
                  осуществляется при покупке от 970 рублей для Самары, Тольятти;
                  от 2000 рублей для Москвы (в пределах МКАД) и Санкт-Петербурга
                  (в пределах КАД).{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="GTBM4JEN20"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      GTBM4JEN20
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/ZeSpMq?erid=2VtzqxiABSf"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={901535}
      data-ym-id={10166}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_cfbb8638282ecf381bc356e3aacac780.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_57a874e264e1839039f23d29290854b2.jpeg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">СберМаркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  СберМаркет — Скидка 450 руб. от 1 000 руб. на первый заказ в
                  СберМаркете в Аптеках + бесплатная доставка!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ИНСТАМАРТ СЕРВИС» , ИНН 9705118142 <br />
                  erid: 2VtzqxAmeaK{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 450 руб. от 1 000 руб. на первый заказ в
                  СберМаркете в Аптеках + бесплатная доставка по уникальному
                  промокоду. Скидка суммируется со всеми акциями и скидками на
                  товары! Лучшее время, чтобы совершить свой первый заказ в
                  СберМаркете! Бесплатная доставка любого заказа от любой суммы!
                  Акция доступна для новых клиентов по всей России, кроме
                  Ижевска и Ишима. Доступность сервиса в вашем городе проверяйте
                  в мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="1r1xzsq7"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      1r1xzsq7
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/heQgkN?erid=2VtzqxAmeaK"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={898326}
      data-ym-id={10163}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_b9edd7cf539d45b21f83c31afcb01310.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_08900d21c74c9ec84187ef7bbd77c267.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">
                        Магнит Доставка
                      </h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Магнит Доставка — скидка 25% на первый заказ от 1000 руб!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Тандер» , ИНН 2310031475 <br />
                  erid: 2Vtzqx6KgjH{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку 25% на первый заказ от 1000 руб из магазинов
                  Магнит Косметик, Магнит Экспресс и Гипермаркет Магнит в
                  мобильном приложении и на веб-сайте Магнит Доставка по
                  уникальному промокоду! Сервис может самостоятельно определять
                  минимальную сумму заказа в зависимости от зоны доставки,
                  повышенного спроса и т.д. Акция суммируется с другими скидками
                  и спецпредложениями в приложении!.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="SEA82214"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      SEA82214
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/Cenlag?erid=2Vtzqx6KgjH"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={891810}
      data-ym-id={10155}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_072a7dd309a5be9bc1996b09421fb5b5.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_b1a84d120745e98fcd397828714edd83.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Яндекс.Маркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 10 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Яндекс Маркет — Первоклассная Распродажа!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ЯНДЕКС» , ИНН 7736207543 <br />
                  erid: BRBCaQT7cqRmJqUoDx8mgnzDUhaFchu{" "}
                </p>
                <p className="actions-grid-item__details">
                  Собирайся в школу вместе с Яндекс Маркет. Одежда и
                  канцелярские принадлежности для школьников, а также смартфоны
                  и умные часы, текстиль, товары для дома, занятий спортом и
                  многие другие. Заказы по ссылке доступны на сайте и в
                  мобильном приложении для всех клиентов по всей России.{" "}
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/FevxF1?erid=BRBCaQT7cqRmJqUoDx8mgnzDUhaFchu"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={890215}
      data-ym-id={10149}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_f404b496d7745349cba0dfa8b9c06603.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_f4790718944248484e5403de39d7d9c3.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">
                        Перекрёсток Vprok
                      </h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Перекрёсток Vprok — Скидка 1 500 руб. на первый заказ от 7 500
                  руб. + бесплатная доставка!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Онлайн-Гипермаркет» , ИНН 9722004963 <br />
                  erid: 2VtzqwnXqM9{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 1 500 руб. на первый заказ от 7 500 руб. на
                  сайте и в приложении с бесплатной доставкой по уникальному
                  промокоду. Закажите продукты и необходимые товары со скидкой
                  на дачу, домой или в офис! Акция доступна для клиентов из
                  Москвы, Московской области, Санкт-Петербурга, Ленинградской
                  области, Рязани, Тулы, Твери, Владимирской области, Калужской
                  области. Промокоды действуют до 30.09, не распространяются на
                  товары со скидками и товары-исключения{" "}
                  <a
                    href="http://vprok.ru/s-exc."
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    http://vprok.ru/s-exc.
                  </a>{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="BLACK1500"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      BLACK1500
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/feSaVS?erid=2VtzqwnXqM9"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={886491}
      data-ym-id={10143}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_012da52732b364864162b33f2ed5bed1.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_78ffcc76f7f5d3a66e4071ff18ac9326.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">SUNLIGHT</h4>
                      <p className="actions-grid-item__category">Мода</p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 12 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  SUNLIGHT — дополнительная скидка 53% на второе украшение для
                  всех! Та самая распродажа!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «СОЛНЕЧНЫЙ СВЕТ» , ИНН 7731316845 <br />
                  erid: 2VtzqwZBwp3{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите дополнительную скидку 53% на второе украшение в
                  корзине по промокоду в мобильном приложении или на сайте.
                  Действует только онлайн. Акция доступна для всех онлайн
                  клиентов по всей России без минимальной суммы заказа. Промокод
                  можно использовать совместно с бонусными рублями магазина.
                  Бесплатная доставка осуществляется по всей России. При первой
                  установке мобильного приложения – украшение в подарок.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="pl3417909"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      pl3417909
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/oel7KE?erid=2VtzqwZBwp3"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={820427}
      data-ym-id={9975}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_c0d0ad250f289e9771e589b81c20aa3f.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_c1c0f20bab16cfd2dc05af0951cfde93.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Банк Открытие</h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Банк Открытие дебетовая карта «OPENCARD» — получи кэшбэк 700
                  бонусных рублей!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ПАО БАНК «ФК ОТКРЫТИЕ» , ИНН 7706092528 <br />
                  erid: 2VtzqvMWXZq{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформи дебетовую карту «OPENCARD» Банка Открытие, соверши
                  покупки на сумму от 700 руб. в первые 30 дней с момента
                  оформления заявки и получи 700 бонусных руб. в течение 60 дней
                  с момента наступления месяца, следующего за месяцем совершения
                  покупки! А также по карте «OPENCARD» на бонусный счет
                  начисляется кешбэк до 1,5% на все и до 5% на выбранные
                  категории! Акция доступна только для клиентов, у которых нет и
                  никогда ранее не было какой-либо кредитной или дебетовой карты
                  Банка Открытие. Список городов присутствия офисов банка:
                  Абакан, Алексеевка, Анапа, Ангарск, Армавир, Архангельск,
                  Асбест, Астрахань, Ачинск, Балашиха, Барабинск, Барнаул,
                  Белгород, Белово, Белорецк, Белоярский, Белый Яр, Бердск,
                  Березники, Березово, Березовский, Бийск, Биробиджан,
                  Благовещенск, Боровский, Братск, Брянск, Буденновск, Великие
                  Луки, Великий Новгород, Верхняя Пышма, Верхняя Салда,
                  Владивосток, Владикавказ, Владимир, Волгоград, Волгодонск,
                  Волжский, Вологда, Воронеж, Выборг, Вязники, Вязьма, Гатчина,
                  Геленджик, Горноправдинск, Дзержинск, Димитровград, Добрянка,
                  Долгопрудный, Дубна, Екатеринбург, Железногорск, Жирновск,
                  Жуковский, Заречный, Зеленоград, Иваново, Игрим, Ижевск,
                  Излучинск, Иркутск, Ишим, Йошкар-Ола, Казань, Калининград,
                  Калуга, Каменск-Уральский, Камышин, Канск, Кемерово,
                  Кингисепп, Киров, Ковров, Когалым, Коломна,
                  Комсомольск-на-Амуре, Королев, Кострома, Красногорск,
                  Краснодар, Краснокаменск, Краснотурьинск, Красноярск,
                  Кронштадт, Кстово, Курган, Курск, Курчатов, Лангепас,
                  Ленинск-Кузнецкий, Лесной, Липецк, Люберцы, Лянтор,
                  Магнитогорск, Майский, Малиновский, Мегион, Междуреченск,
                  Минусинск, Москва, Мурманск, Муром, Мытищи, Набережные Челны,
                  Нальчик, Нарьян-Мар, Невинномысск, Нефтекамск, Нижневартовск,
                  Нижнесортымский, Нижний Новгород, Нижний Тагил, Новоаганск,
                  Новоалтайск, Новокузнецк, Новомосковск, Новороссийск,
                  Новосибирск, Новоуральск, Новочеркасск, Новый Уренгой,
                  Норильск, Ноябрьск, Нягань, Обнинск, Одинцово, Октябрьский,
                  Омск, Оренбург, Орехово-Зуево, Орёл, Оса, Пенза, Первоуральск,
                  Пермь, Петергоф, Петрозаводск, Петропавловск-Камчатский,
                  Подольск, Пойковский, Покачи, Прокопьевск, Псков, Пушкин,
                  Пыть-Ях, Пятигорск, Радужный, Ржев, Рославль, Ростов-на-Дону,
                  Рубцовск, Рыбинск, Рязань, Самара, Санкт-Петербург, Саранск,
                  Саратов, Сафоново, Североуральск, Северск, Сергиев Посад,
                  Серпухов, Сестрорецк, Смоленск, Советск, Советский, Сочи,
                  Ставрополь, Старый Оскол, Стерлитамак, Стрежевой, Ступино,
                  Сургут, Сызрань, Сыктывкар, Таганрог, Тамбов,Тверь, Тихвин,
                  Тобольск, Тольятти, Томск,Топки, Трехгорный, Тула, Тюмень,
                  Улан-Удэ, Ульяновск, Урай, Усинск, Уссурийск, Уфа, Ухта,
                  Федоровский, Фролово, Хабаровск, Ханты-Мансийск, Химки,
                  Чебоксары, Челябинск, Череповец, Чернушка,Чита, Шадринск,
                  Шахты ,Шуя, Щелково, Электросталь, Энгельс, Югорск,
                  Южно-Сахалинск, Южноуральск, Юрга Якутск, Ярославль, Ярцево.
                  Оформить доставку карты на дом возможно в следующих городах:
                  Москва (Московская обл.), Санкт-Петербург (Ленинградская
                  обл.), Новосибирск (Новосибирская обл.), Екатеринбург
                  (Свердловская обл.), Челябинск (Челябинская обл.), Пермь
                  (Пермский край), Омск (Омская обл.), Казань (Татарстан респ.),
                  Краснодар (Краснодарский край), Нижний Новгород (Нижегородская
                  обл.), Тюмень (Тюменская обл.), Красноярск (Красноярский
                  край), Самара (Самарская обл.), Ростов-на-Дону (Ростовская
                  обл.), Ижевск (Удмуртская респ.), Воронеж (Воронежская обл.),
                  Уфа (Башкортостан респ.), Ярославль (Ярославская обл.),
                  Тольятти (Самарская обл.), Иркутск (Иркутская обл.), Волгоград
                  (Волгоградская обл.), Саратов (Саратовская обл.), Калининград
                  (Калининградская обл.), Хабаровск (Хабаровский край), Сургут
                  (Ханты-Мансийский авт. округ-Югра), Ханты-Мансийск
                  (Ханты-Мансийский авт. округ-Югра), Нижневартовск
                  (Ханты-Мансийский авт. округ-Югра).{" "}
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/MwNy3h?erid=2VtzqvMWXZq"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={916272}
      data-ym-id={10197}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_0977a78e84e5fd46d0f194dd2b26a43e.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_2e81cb56b648310d2467d0ff4c0b5513.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">ГЛОБУС</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 10 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  ГЛОБУС — скидка 200 руб. при покупке от 2500 руб. на школьные
                  товары!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Гиперглобус» , ИНН 7743543761 <br />
                  erid: 2VtzqxksN4F{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку 200 руб. при покупке от 2500 руб. на школьные
                  товары в категории “В школу играючи”! Скидка суммируется со
                  всеми акциями и скидками на товары! Не распространяется на
                  электронику и бытовую технику. Акция доступна для любых
                  клиентов из Москвы и МО на сайте и в приложении.
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="G248B-52662"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      G248B-52662
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/teKDjT?erid=2VtzqxksN4F"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={879578}
      data-ym-id={10130}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_7ca7dfa7058d61ea76680e5054dfef6a.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_447a54ffeab0208dcd2648560567fda4.jpeg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">СберМаркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  СберМаркет — 800 бонусов СберСпасибо за первый заказ от 1 500
                  ₽!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ИНСТАМАРТ СЕРВИС» , ИНН 9705118142 <br />
                  erid: 2VtzqwJN4zb{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите 800 бонусов СберСпасибо за первый заказ от 1 500
                  рублей по уникальному промокоду. Акция активна для участников
                  программы СберСпасибо при авторизации по Сбер ID. Не действует
                  при заказе в "Самокате", выборе способа оплаты: «На кассе»,
                  «Частями», оплате товаров из категории «Аптеки». Лучшее время,
                  чтобы совершить свой первый заказ в СберМаркете. Бесплатная
                  доставка любого заказа от любой суммы! Акция доступна для
                  новых клиентов по всей России. Доступность сервиса в вашем
                  городе проверяйте в мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="ozluwi7n"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      ozluwi7n
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/Leb4wy?erid=2VtzqwJN4zb"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={877831}
      data-ym-id={10124}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_3f8062684a98b4954de170b923701dea.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_e085fd6f09a5bdeed644ca8a97d42907.jpeg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">СберМаркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  СберМаркет — Скидка 400 руб. на любой заказ от 999 руб. в
                  ресторанах + бесплатная доставка{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ИНСТАМАРТ СЕРВИС» , ИНН 9705118142 <br />
                  erid: 2VtzqwCS7sD{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 400 руб. на любой заказ от 999 руб. в
                  ресторанах + бесплатную доставку! Предложение суммируется с
                  акциями сайта и доступна для всех клиентов во многих городах
                  России. Доступность сервиса в вашем городе проверяйте в
                  мобильном приложении.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="mdf1oon44"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      mdf1oon44
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/qeb4yB?erid=2VtzqwCS7sD"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={714201}
      data-ym-id={9662}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_f5696034be9d20dd191f1df00f559d97.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_d7aa3d4bd36f351c46baab353c4b618f.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Альфа-банк</h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Альфа-Банк кредитная карта – 365 дней льготного периода!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Альфа-банк» , ИНН 7728168971 <br />
                  erid: 2VtzqusLmDH{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформи кредитную карту «Целый год без процентов» по уникальной
                  ссылке и получи бесплатное обслуживание! Снятие наличных
                  БЕСПЛАТНО до 50 000 руб. в любых банкоматах каждый месяц!
                  Акция доступна только для новых клиентов банка из всех
                  регионов РФ, а также для тех, у кого на момент проведения
                  акции закрыта кредитная карта «Целый год без процентов»
                  Альфа-Банка и счёт по ней. Новый клиент для продукта Кредитная
                  карта - тот, у кого за последние 12 месяцев (т.е. в период с
                  8.04.2022 по 9.04.2023) нет и не было договора по Кредитной
                  карте. А если карта была ранее, то дата закрытия договора не
                  должна быть позднее 07.04.2022 включительно. Подробная
                  информация будет доступна на посадочной странице. С перечнем
                  городов, где возможна доставка карты на дом, вы можете
                  ознакомиться по ссылке:{" "}
                  <a
                    href="https://alfabank.servicecdn.ru/site-upload/c3/52/967/city_delivery.pdf"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    https://alfabank.servicecdn.ru/site-upload/c3/52/967/city_delivery.pdf
                  </a>
                  С тарифами карты «Целый год без % на любые покупки» можно
                  ознакомиться по ссылке:{" "}
                  <a
                    href="https://alfabank.servicecdn.ru/site-upload/c7/61/967/tariffs_1year_1_21102022.pdf"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    https://alfabank.servicecdn.ru/site-upload/c7/61/967/tariffs_1year_1_21102022.pdf
                  </a>
                  Памятка о беспроцентном периоде карты «Целый год без
                  процентов»:{" "}
                  <a
                    href="https://alfabank.servicecdn.ru/site-upload/66/ae/967/memo_grace_period_09112022.pdf"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    https://alfabank.servicecdn.ru/site-upload/66/ae/967/memo_grace_period_09112022.pdf
                  </a>
                  Кешбек начисляется рублями до 10 числа следующего месяца.
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/EwdFjh?erid=2VtzqusLmDH"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={874155}
      data-ym-id={10109}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_3a2f0de013c613900c7e68c6abb19c31.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_3ce538579bad68de5a451afb9b28affa.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">
                        Перекрёсток Vprok
                      </h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Перекрёсток Vprok — Скидка 10% на любой заказ от 4 000 руб. +
                  бесплатная доставка{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Онлайн-Гипермаркет» , ИНН 9722004963 <br />
                  erid: 2Vtzqvy6EL7{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 10% на любой заказ от 4 000 руб. на сайте и в
                  приложении с бесплатной доставкой по уникальному промокоду.
                  Закажите продукты и необходимые товары со скидкой на дачу,
                  домой или в офис! Акция доступна для клиентов из Москвы,
                  Московской области, Санкт-Петербурга, Ленинградской области,
                  Рязани, Тулы, Твери, Владимирской области, Калужской области.
                  Промокоды действуют до 30.09, не распространяются на товары со
                  скидками и товары-исключения{" "}
                  <a
                    href="http://vprok.ru/s-exc"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    http://vprok.ru/s-exc
                  </a>{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="10BLACK10"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      10BLACK10
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/ieSfuo?erid=2Vtzqvy6EL7"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={874161}
      data-ym-id={10108}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_c201d2ee5aa5e98e7f521c694e8620e9.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_b0994f25e14c5f558bd0fee197d2fab5.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">
                        Перекрёсток Vprok
                      </h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Перекрёсток Vprok — Скидка 25% на первые 3 заказа от 3 500
                  руб. + бесплатная доставка{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Онлайн-Гипермаркет» , ИНН 9722004963 <br />
                  erid: 2VtzqvwcF3m{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 25% на первые 3 заказа от 3 500 руб. на сайте
                  и в приложении с бесплатной доставкой по уникальному
                  промокоду. Закажите продукты и необходимые товары со скидкой
                  на дачу, домой или в офис! Акция доступна для клиентов из
                  Москвы, Московской области, Санкт-Петербурга, Ленинградской
                  области, Рязани, Тулы, Твери, Владимирской области, Калужской
                  области. Промокоды действуют до 30.09, не распространяются на
                  товары со скидками и товары-исключения{" "}
                  <a
                    href="http://vprok.ru/s-exc"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    http://vprok.ru/s-exc
                  </a>{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="25BLACK25"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      25BLACK25
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/geSdci?erid=2VtzqvwcF3m"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={843345}
      data-ym-id={10035}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_4e553c0cec38322b881ea9df172298f0.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_75289a30f4e0233d9e04134e7b580cc3.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Яндекс.Маркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Яндекс Маркет — скидка 10% на первый заказ от 1 000 руб на все
                  товары!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ЯНДЕКС» , ИНН 7736207543 <br />
                  erid: BRBCaQT7cqRmJqUoDx5VDQenEmZrYz8{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку 10% на первый заказ от 1 000 рублей по
                  уникальному промокоду. Скидка действует на весь ассортимент
                  Яндекс Маркета. Максимальный размер скидки 300 рублей. Акция
                  доступна на сайте и в мобильном приложении для новых клиентов.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="MS135-AF"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      MS135-AF
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/zw7DHe?erid=BRBCaQT7cqRmJqUoDx5VDQenEmZrYz8"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={714197}
      data-ym-id={9663}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_0c70ba5f4d02ee01ee8e5e553803f9b3.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_9aa7ebc0e0eb44fadaf40a8961094ee5.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Альфа-Банк</h4>
                      <p className="actions-grid-item__category">
                        Финансовые продукты
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Альфа-Банк дебетовая карта — Оформи первым стикер от Альфа
                  Банка!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «Альфа-банк» , ИНН 7728168971 <br />
                  erid: 2VtzqutpkVd{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оставь заявку и получи первым стикер от Альфа Банка уже в
                  июне! Плати, как привык — в одно касание! Стикер это дебетовая
                  Альфа-Карта, только в удобном формате. Вам будут доступны все
                  основные преимущества: кэшбэк, бесплатные переводы и платежи,
                  снятие наличных без комиссии и так далее. Вам нужно привязать
                  стикер к любому вашему счёту. С дебетовой Альфа-Картой можно
                  получать повышенный кэшбэк в разных категориях На отпуск • 20%
                  на отели в сервисе Альфа Путешествия • 10% на авиабилеты в
                  сервисе Альфа Путешествия • 10% на интернет за границей на
                  сайте Telwel На косметику для загара • 15% в интернет-магазине
                  Yves Rocher • До 10% в магазине и на сайте РИВ ГОШ • До 8% в
                  интернет-магазине Л’Этуаль На покупки для пикника • 7,5% на
                  сайте Ашан • 14% в сервисе Самокат • 15% в сервисе Магнит
                  Доставка А ещё самый большой в стране кэшбэк на Яндекс Маркет:
                  10% на все покупки до 50 000 ₽ 🔥 ❗️Кэшбэк до 100% на
                  категорию, 5% в трёх и 1% на всё по Альфа-Карте тоже
                  действует. Акция доступна для всех клиентов. Перечень городов,
                  где осуществляется доставка стикера на дом, см. на сайте.
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/8wuxgV?erid=2VtzqutpkVd"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={874164}
      data-ym-id={10110}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_b4f59958c31d5f5dbf263223360079ce.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_8f36cd30e76fdca6b5810f513246151b.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">
                        Перекрёсток Vprok
                      </h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Перекрёсток Vprok — Скидка 1 000 руб. на первый заказ от 5 000
                  руб. + бесплатная доставка{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Онлайн-Гипермаркет» , ИНН 9722004963 <br />
                  erid: 2VtzqvzaDcT{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 1 000 руб. на первый заказ от 5 000 руб. на
                  сайте и в приложении с бесплатной доставкой по уникальному
                  промокоду. Закажите продукты и необходимые товары со скидкой
                  на дачу, домой или в офис! Акция доступна для клиентов из
                  Москвы, Московской области, Санкт-Петербурга, Ленинградской
                  области, Рязани, Тулы, Твери, Владимирской области, Калужской
                  области. Промокоды действуют до 30.09, не распространяются на
                  товары со скидками и товары-исключения{" "}
                  <a
                    href="http://vprok.ru/s-exc"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    http://vprok.ru/s-exc
                  </a>{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="BLACK1000"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      BLACK1000
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/7eSf2A?erid=2VtzqvzaDcT"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={874165}
      data-ym-id={10107}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_41d4ba0b7091807e0ae88ac8bc9a4fc9.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_ffbf738c2959149ddbce986a6360e830.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">
                        Перекрёсток Vprok
                      </h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Перекрёсток Vprok — Скидка 900 руб. на первые 3 заказа от 1
                  500 руб. + бесплатная доставка!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Онлайн-Гипермаркет» , ИНН 9722004963 <br />
                  erid: 2Vtzqvv8FmR{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получите скидку 300 на каждый из первых 3 заказов от 1 500
                  руб. на сайте и в приложении с бесплатной доставкой по
                  уникальному промокоду. Закажите продукты и необходимые товары
                  со скидкой на дачу, домой или в офис! Акция доступна для
                  клиентов из Москвы, Московской области и Санкт-Петербурга.
                  Промокоды действуют до 30.09, не распространяются на товары со
                  скидками и товары-исключения{" "}
                  <a
                    href="http://vprok.ru/s-exc"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    http://vprok.ru/s-exc
                  </a>{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="300BLACK300"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      300BLACK300
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/1eSsP7?erid=2Vtzqvv8FmR"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={861142}
      data-ym-id={10085}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_49ade8195b5bbf4361a332fcd5db2d7c.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_5456d85aa16e6348a4baba15eb6657b7.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Otello</h4>
                      <p className="actions-grid-item__category">Путешествия</p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Otello – скидка 15% на первое бронирование отелей для
                  путешествий! От создателей 2ГИС{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ДубльГИС» , ИНН 5405276278 <br />
                  erid: 2VtzqvpCJe3{" "}
                </p>
                <p className="actions-grid-item__details">
                  Регистрируйтесь по ссылке в онлайн-сервисе Otello и получите
                  скидку 15% в мобильном приложении или на сайте на первое
                  бронирование отелей, хостелов и апартаментов для путешествий
                  по России! Скидка не может превышать 1000р. А также: —
                  Оплачивайте до 99% стоимости бонусами СберСпасибо — Получайте
                  до 10% Кешбэк бонусами СберСпасибо: 10% при первом
                  бронировании, 5% при повторных Скидка 15% суммируется со всеми
                  акциями и предложениями, предоставляется в мобильном
                  приложении или на сайте. Акция доступна для клиентов 18+ из
                  РФ.{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="HACUPON15"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      HACUPON15
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/HeThG6?erid=2VtzqvpCJe3"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={799332}
      data-ym-id={9923}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_2299bbf24e6633b06c9f6aade7c17f83.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_097cd24b87eda861d37359dbbb498b88.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Яндекс.Маркет</h4>
                      <p className="actions-grid-item__category">
                        Маркетплейсы
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Яндекс Маркет — соверши покупку по уникальной ссылке блогера!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «ЯНДЕКС» , ИНН 7736207543 <br />
                  erid: 3MtFQRkqfB2jnmPWvsp4j6eN8pGCdP{" "}
                </p>
                <p className="actions-grid-item__details">
                  Оформи заказ по уникальной ссылке! Заказы по ссылке доступны
                  на сайте и в мобильном приложении для всех клиентов по всей
                  России.
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/TwJQEQ?erid=3MtFQRkqfB2jnmPWvsp4j6eN8pGCdP"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={727262}
      data-ym-id={9719}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_0f3d3f109b26d9a528c8b44dcc940b86.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_70796d53e5e721109677b4981b094d0b.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">METRO</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Metro Cash&amp;Carry — получи скидку 3000 руб. на первые
                  покупки!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Метро Кэш энд Керри» , ИНН 7704218694 <br />
                  erid: 2Vtzqxby6tF{" "}
                </p>
                <p className="actions-grid-item__details">
                  Зарегистрируй по уникальному промокоду карту покупателя и
                  получи целых 3000 бонусных рублей на покупки в Метро. Акция
                  доступна в оффлайн точках Метро только для новых клиентов на
                  территории РФ, кроме республики Крым и г.Севастополь.
                  Механика: — 500 бонусных рублей начисляются за регистрацию
                  карты по персональному промокоду и действуют 30 дней с момента
                  начисления. — Еще 500 бонусных рублей начисляются за первую
                  покупку, совершенную в течение 30 дней с момента выпуска
                  карты, и действуют 14 дней с момента начисления. — И еще 500
                  бонусных рублей начисляются за вторую покупку, совершенную в
                  течение 14 дней после первой покупки, и действуют 14 дней с
                  момента начисления. 1 рубль =1 бонус. + 1500 бонусных рублей
                  на покупки в онлайн-магазине! Максимальное списание до 20% от
                  покупки, не списываются при покупке табачной и алкогольной
                  продукции, а также на безалкогольное вино, при приобретении
                  подарочных карт METRO и при выборе расчета на кассе по форме
                  оплаты «Предоплата».{" "}
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="n64ec"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      n64ec
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/5wFhfH?erid=2Vtzqxby6tF"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={727327}
      data-ym-id={9720}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_78dc5a2e0ed208534d96c7d51208077e.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_5f4b266328f61a5693ad6dea4baf20cf.png)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">METRO</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Metro Cash&amp;Carry — Получи скидку 20% на первые 3 покупки!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Метро Кэш энд Керри» , ИНН 7704218694 <br />
                  erid: 2Vtzqxew5Sw{" "}
                </p>
                <p className="actions-grid-item__details">
                  Зарегистрируй по уникальному промокоду карту покупателя и
                  получи скидку 20% на первые 3 покупки без минимальной суммы!
                  Механика: — Купон на скидку 20% для первой покупки поступит на
                  почту в течение 24 часов после регистрации карты — Купон на
                  скидку 20% для второй покупки приходит на почту после
                  совершения первой покупки в течение 14 дней после регистрации
                  — Купон на скидку 20% для третьей покупки приходит после
                  совершения второй покупки в течение 14 дней после первой
                  покупки Акция доступна новым покупателям в оффлайн магазинах
                  на территории РФ, кроме республики Крым и г.Севастополь. Срок
                  действия купонов 14 дней после совершения покупки, за которую
                  выдан купон, либо после регистрации. Скидка предоставляется на
                  все товары, кроме продукции отделов «Оптовый алкоголь»,
                  «Табак», автошины и телевизоры, товаров категории «Всегда
                  нужно». Использовать соответствующий купон можно не более
                  одного раза и только по одной товарной накладной (кассовому
                  чеку) в ТЦ METRO и не распространяется на промо товары.
                  Ограничение по сумме скидки по купону – не более 1000 руб. При
                  возврате товара, купленного с использованием купона, купон
                  считается реализованным, его повторная выдача не производится.
                  Условием предоставления скидки является предъявление купона на
                  кассе до «закрытия» накладной. В случае если цена алкогольной
                  продукции со скидкой ниже минимальной цены, установленной
                  законом, товар продается по установленной законом цене.
                  Денежный эквивалент скидок не предоставляется. Предложение
                  действительно по 31.12.2023 г. включительно.
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="5m5pg"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      5m5pg
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/CwFcIG?erid=2Vtzqxew5Sw"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={674461}
      data-ym-id={9402}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_3f3293d42d6e893809a944adf8cdd986.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_6f17603400e4630962b8b9e5065b4063.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">ВкусВилл</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  ВкусВилл Доставка — получи скидку 200 руб. на первый заказ от
                  1 000 руб.!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «ВкусВилл» , ИНН 7734443270 <br />
                  erid: 2VtzquntoNF{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку 200 руб. на первый заказ доставки продуктов из
                  магазинов ВкусВилл от 1 000 руб. по уникальному промокоду.
                  Акция доступна для новых клиентов по всей России на сайте и в
                  мобильном приложении, которые ранее никогда не делали заказ на
                  доставку из магазинов ВкусВилл, а также никогда не вводили
                  промокод в приложении или на сайте. Скидка по промокоду
                  суммируется со всеми акциями и спецпредложениями. Перечень
                  городов, где доступна доставка, указан по ссылке. Зелёным
                  выделены города, в которых доставка появилась совсем недавно:{" "}
                  <a
                    href="https://docs.google.com/spreadsheets/d/1KAbq1sxJGBuREmoG6SHA_SIiuShVC1WhW7hq9-Fe3NA/edit?usp=sharing"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    https://docs.google.com/spreadsheets/d/1KAbq1sxJGBuREmoG6SHA_SIiuShVC1WhW7hq9-Fe3NA/edit?usp=sharing
                  </a>
                  Как получить скидку на первый заказ по промокоду: 1.
                  Добавляете товары на сумму от 1 000 рублей в корзину. 2.
                  Нажимаете на баннер «Примените промокод». 3. Вводите
                  уникальный промокод, нажимаете «Добавить». 4. Далее у вас
                  открывается окно «Выберите ваш купон». Выбираете купон «Скидка
                  по купону 200 руб.». 5. Нажимаете «Применить». Во ВкусВилл
                  теперь доступна доставка свежего хлеба! На базе дарксторов
                  компании открыто 30 пекарен, где каждое утро готовят: хлеб,
                  сладкую выпечку, мини-хлеб, национальную выпечку и крафтовый
                  хлеб, например, тыквенный или морковный. Попробуйте наш
                  свежевыпеченный хлеб сами и обязательно расскажите об этом
                  сервисе своим друзьям, знакомым и подписчикам!
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="VS4561"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      VS4561
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/X4fvu?erid=2VtzquntoNF"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={674468}
      data-ym-id={9401}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_6b11113e9e493688b70f93e43d4f7c27.png)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_144443bbf822784e7df71af0eded234b.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">ВкусВилл</h4>
                      <p className="actions-grid-item__category">
                        Еда и напитки
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  ВкусВилл Доставка — получи скидку 350 руб. на первый заказ от
                  2 500 руб.!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама АО «ВкусВилл» , ИНН 7734443270 <br />
                  erid: 2VtzqugxrEs{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку 350 руб. на первый заказ доставки продуктов из
                  магазинов ВкусВилл от 2 500 руб. по уникальному промокоду.
                  Акция доступна для новых клиентов по всей России на сайте и в
                  мобильном приложении, которые ранее никогда не делали заказ на
                  доставку из магазинов ВкусВилл, а также никогда не вводили
                  промокод в приложении или на сайте. Скидка по промокоду
                  суммируется со всеми акциями и спецпредложениями. Перечень
                  городов, где доступна доставка, указан по ссылке. Зелёным
                  выделены города, в которых доставка появилась совсем недавно:{" "}
                  <a
                    href="https://docs.google.com/spreadsheets/d/1KAbq1sxJGBuREmoG6SHA_SIiuShVC1WhW7hq9-Fe3NA/edit?usp=sharing"
                    target="_blank"
                    className=""
                    style={{}}
                  >
                    https://docs.google.com/spreadsheets/d/1KAbq1sxJGBuREmoG6SHA_SIiuShVC1WhW7hq9-Fe3NA/edit?usp=sharing
                  </a>
                  Как получить скидку на первый заказ по промокоду: 1.
                  Добавляете товары на сумму от 2 500 рублей в корзину. 2.
                  Нажимаете на баннер «Примените промокод». 3. Вводите
                  уникальный промокод, нажимаете «Добавить». 4. Далее у вас
                  открывается окно «Выберите ваш купон». Выбираете купон «Скидка
                  по купону 350 руб.». 5. Нажимаете «Применить». Во ВкусВилл
                  теперь доступна доставка свежего хлеба! На базе дарксторов
                  компании открыто 30 пекарен, где каждое утро готовят: хлеб,
                  сладкую выпечку, мини-хлеб, национальную выпечку и крафтовый
                  хлеб, например, тыквенный или морковный. Попробуйте наш
                  свежевыпеченный хлеб сами и обязательно расскажите об этом
                  сервисе своим друзьям, знакомым и подписчикам!
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="5V84A9"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      5V84A9
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/k4tZ8?erid=2VtzqugxrEs"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={561072}
      data-ym-id={8749}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_955f249213362954cf18e5d382a8de70.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_b60c1d2d8c0ad3d1b4254abbd98ccaba.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Бетховен</h4>
                      <p className="actions-grid-item__category">
                        Товары для животных
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Бетховен — скидки и акции до 50% по уникальной ссылке!{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Пет Ритейл» , ИНН 7726650932 <br />
                  erid: 2VtzqudzsgB{" "}
                </p>
                <p className="actions-grid-item__details">
                  Широкий ассортимент товаров для ваших питомцев по выгодной
                  цене, регулярные скидки и спецпредложения. Получи 3% кешбека с
                  первой покупки и оплачивай ими до 50% покупки! Переходите по
                  ссылке и участвуйте в самой летней распродаже до 28 августа.
                  Минимальная сумма заказа отсутствует. Бесплатная доставка
                  осуществляется при покупке от 970 рублей для Самары и
                  Тольятти; от 1500 рублей для Москвы (в пределах МКАД) и
                  Санкт-Петербурга (в пределах КАД). Акция доступна для всех
                  клиентов. Присутствие магазина в вашем городе уточняйте на
                  сайте.{" "}
                </p>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/gTAQc?erid=2VtzqudzsgB"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div
      className="popup-wrap"
      data-popup={472127}
      data-ym-id={8088}
      style={{ display: "none" }}
    >
      <div className="popup-wrap__content">
        <div className="action-popup">
          <div className="action-popup__content">
            <div className="actions-grid-item">
              <div
                className="actions-grid-item__image"
                style={{
                  backgroundImage:
                    "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_ccd27b16cb5b5011fe45e91f4164c7ad.jpg)"
                }}
              >
                <button className="action-popup__close" data-close-popup="">
                  <svg width={24} height={24}>
                    <use href="#icon-close" />
                  </svg>
                </button>
              </div>
              <div className="actions-grid-item__content">
                <div className="actions-grid-item__main">
                  <div className="actions-grid-item__brand">
                    <div
                      className="actions-grid-item__logo"
                      style={{
                        backgroundImage:
                          "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_logo_4a2bea5f1534b909302232e480505216.jpg)"
                      }}
                    />
                    <div className="actions-grid-item__brand-info">
                      <h4 className="actions-grid-item__name">Бетховен</h4>
                      <p className="actions-grid-item__category">
                        Товары для животных
                      </p>
                    </div>
                  </div>
                  <span className="actions-grid-item__deadline">
                    До 30 сентября{" "}
                  </span>
                </div>
                <p className="actions-grid-item__info actions-grid-item__info--bold actions-grid-item__info--popup">
                  Бетховен — скидка 15% на весь каталог + 3% на самовывоз.{" "}
                </p>
                <p className="actions-grid-item__details">
                  Реклама ООО «Пет Ритейл» , ИНН 7726650932 <br />
                  erid: 2VtzquZYuq9{" "}
                </p>
                <p className="actions-grid-item__details">
                  Получи скидку 15% на весь каталог товаров по индивидуальному
                  промокоду блогера и дополнительно скидку 3% при самовывозе.
                  Минимальная сумма заказа отсутствует! Акция доступна для всех
                  клиентов на сайте по всей России. Присутствие магазина в вашем
                  городе уточняйте на сайте. Бесплатная доставка осуществляется
                  при покупке от 970 рублей для Самары, Тольятти; от 2000 рублей
                  для Москвы (в пределах МКАД) и Санкт-Петербурга (в пределах
                  КАД). Cкидка не распространяется на товары торговых марок
                  Catsan, Cesar, Chappi, Dreamies, Felix, FRISKIES, Gourmet,
                  Kitekat, Pedigree, Perfect Fit, Sheba, Whiskas, не суммируется
                  с другими скидками и акциями (кроме скидки 3% за самовывоз,
                  при условии, что суммарная скидка не превышает 20%). Выбери
                  эффективную защиту от паразитов. Примени промокод на скидку
                  -15% на товары из ветаптеки от блох и клещей без скидки.
                  Рекомендуем закупаться с марта по октябрь.
                </p>
                <div className="actions-grid-item__promo">
                  <div className="actions-grid-item-promo">
                    <div className="actions-grid-item-promo__head">
                      <strong className="actions-grid-item-promo__caption">
                        Твой промокод
                      </strong>
                      <button
                        className="actions-grid-item-promo__copy js-copy-promocode"
                        data-clipboard-text="GTB964Q2"
                      >
                        <svg width={18} height={20}>
                          <use href="#icon-copy-promocode" />
                        </svg>
                      </button>
                    </div>
                    <strong className="actions-grid-item-promo__code">
                      GTB964Q2
                    </strong>
                  </div>
                </div>
                <a
                  className="actions-grid-item__button actions-grid-item__button--popup"
                  target="_blank"
                  href="https://gtblg.ru/Vr5RA?erid=2VtzquZYuq9"
                >
                  Получить выгоду
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div className="actions-head">
      <div className="actions-head__title">
        <img
          className="actions-head__logo"
          src="./Актуальные промокоды скидки купоны акции 2023 — самые выгодные скидки и промокоды!_files/logo_3fca28708d6747d60f1d72dcb370803d.jpg"
        />
        <h1 className="actions-head__caption">
          Актуальные промокоды скидки купоны акции 2023
        </h1>
      </div>
      <div className="actions-head__social">
        <span>Больше акций тут:</span>
        <div className="actions-footer-socials actions-footer-socials--head">
          <a
            className="actions-footer-socials__link"
            href="https://t.me/Blackfive50"
            target="_blank"
            onClick="ym(93807298,'reachGoal','telegram');"
          >
            <svg width={24} height={24}>
              <use href="#icon-social-telegram" />
            </svg>
          </a>
        </div>
      </div>
      <button
        className="actions-head__button actions-head__button--filter"
        data-toggle-popup="filters"
      >
        <svg width={18} height={12}>
          <use href="#icon-filter" />
        </svg>
      </button>
      <button
        className="actions-head__button actions-head__button--search"
        data-toggle-search=""
      >
        <svg width={21} height={21}>
          <use href="#icon-search" />
        </svg>
      </button>
    </div>
    <div className="actions-content">
      <form action="https://promo.getblogger.ru/promo?" method="get">
        <div
          className="actions-stripe scrollyeah scrollyeah_active"
          data-shadows="false"
          data-disableiffit="true"
        >
          <div className="scrollyeah__wrap" style={{ width: 999999 }}>
            <div className="scrollyeah__shaft">
              <div className="scrollyeah__wrap" style={{ width: 999999 }}>
                <div className="scrollyeah__shaft">
                  <div className="actions-stripe__item actions-stripe__item--filter">
                    <button
                      type="button"
                      className="actions-stripe-button"
                      data-toggle-popup="filters"
                    >
                      <div className="actions-stripe-button__icon">
                        <svg width={18} height={12}>
                          <use href="#icon-filter" />
                        </svg>
                      </div>
                    </button>
                  </div>
                  <div className="actions-stripe__item">
                    <button
                      name="brands[]"
                      type="submit"
                      value={42664}
                      className="actions-stripe-button"
                    >
                      <div
                        className="actions-stripe-button__image"
                        style={{
                          backgroundImage:
                            "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_e085fd6f09a5bdeed644ca8a97d42907.jpeg)"
                        }}
                      />
                      <span className="actions-stripe-button__amount">12 </span>
                    </button>
                  </div>
                  <div className="actions-stripe__item">
                    <button
                      name="categories[]"
                      type="submit"
                      value={1}
                      className="actions-stripe-button"
                    >
                      <span className="actions-stripe-button__title">
                        Онлайн-сервисы{" "}
                      </span>
                    </button>
                  </div>
                  <div className="actions-stripe__item">
                    <button
                      name="categories[]"
                      type="submit"
                      value={2}
                      className="actions-stripe-button"
                    >
                      <span className="actions-stripe-button__title">
                        Финансовые продукты{" "}
                      </span>
                    </button>
                  </div>
                  <div className="actions-stripe__item">
                    <button
                      name="categories[]"
                      type="submit"
                      value={3}
                      className="actions-stripe-button"
                    >
                      <span className="actions-stripe-button__title">
                        Еда и напитки{" "}
                      </span>
                    </button>
                  </div>
                  <div className="actions-stripe__item">
                    <button
                      name="categories[]"
                      type="submit"
                      value={4}
                      className="actions-stripe-button"
                    >
                      <span className="actions-stripe-button__title">
                        Маркетплейсы{" "}
                      </span>
                    </button>
                  </div>
                  <div className="actions-stripe__item">
                    <button
                      name="categories[]"
                      type="submit"
                      value={5}
                      className="actions-stripe-button"
                    >
                      <span className="actions-stripe-button__title">
                        Красота и здоровье{" "}
                      </span>
                    </button>
                  </div>
                  <div className="actions-stripe__item">
                    <button
                      name="categories[]"
                      type="submit"
                      value={6}
                      className="actions-stripe-button"
                    >
                      <span className="actions-stripe-button__title">
                        Мода{" "}
                      </span>
                    </button>
                  </div>
                  <div className="actions-stripe__item">
                    <button
                      name="categories[]"
                      type="submit"
                      value={7}
                      className="actions-stripe-button"
                    >
                      <span className="actions-stripe-button__title">
                        Путешествия{" "}
                      </span>
                    </button>
                  </div>
                  <div className="actions-stripe__item">
                    <button
                      name="categories[]"
                      type="submit"
                      value={10}
                      className="actions-stripe-button"
                    >
                      <span className="actions-stripe-button__title">
                        Спорт{" "}
                      </span>
                    </button>
                  </div>
                  <div className="actions-stripe__item">
                    <button
                      name="categories[]"
                      type="submit"
                      value={11}
                      className="actions-stripe-button"
                    >
                      <span className="actions-stripe-button__title">
                        Дом и ремонт{" "}
                      </span>
                    </button>
                  </div>
                  <div className="actions-stripe__item">
                    <button
                      name="categories[]"
                      type="submit"
                      value={12}
                      className="actions-stripe-button"
                    >
                      <span className="actions-stripe-button__title">
                        Товары для животных{" "}
                      </span>
                    </button>
                  </div>
                  <div className="actions-stripe__item actions-stripe__item--search">
                    <button
                      type="button"
                      className="actions-stripe-button"
                      data-toggle-search=""
                    >
                      <div className="actions-stripe-button__icon">
                        <svg width={21} height={21}>
                          <use href="#icon-search" />
                        </svg>
                      </div>
                    </button>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </form>
      <form
        className="actions-search"
        action="https://promo.getblogger.ru/promo?"
        method="get"
      >
        <input
          className="actions-search__input"
          name="search"
          defaultValue=""
          type="text"
          autoComplete="off"
          placeholder="Поиск"
        />
        <button
          className="actions-search__button actions-search__button--close"
          type="button"
          data-close-search=""
        >
          <svg width={8} height={14}>
            <use href="#icon-close-search" />
          </svg>
        </button>
        <button
          className="actions-search__button actions-search__button--search"
          type="submit"
        >
          <svg width={18} height={18}>
            <use href="#icon-search" />
          </svg>
        </button>
        <button
          className="actions-search__button actions-search__button--reset"
          id="reset_search"
          type="reset"
        >
          <svg width={21} height={21}>
            <use href="#icon-close" />
          </svg>
        </button>
      </form>
      <div className="summary" />
      <div className="actions-grid">
        <div className="actions-grid__col">
          <div className="actions-grid-item">
            <div
              className="actions-grid-item__image"
              style={{
                backgroundImage:
                  "url(https://storage.yandexcloud.net/getblogger-messenger/ygbp_offer_promo_page_img_a2934a3d2a470ea5ded1fc96871ec417.png)"
              }}
            ></div>
            <div className="actions-grid-item__content">
              <div className="actions-grid-item__main">
                <div className="actions-grid-item__brand">
                  <div
                    className="actions-grid-item__logo"
                    style={{
                      backgroundImage:
                        "url(https://getblogger-messenger.storage.yandexcloud.net/ygbp_offer_logo_7ac7df87f0d60c7a2b545014ddf48c60.png)"
                    }}
                  />
                  <div className="actions-grid-item__brand-info">
                    <h4 className="actions-grid-item__name">Яндекс 360</h4>
                    <p className="actions-grid-item__category">
                      Онлайн-сервисы
                    </p>
                  </div>
                </div>
                <span className="actions-grid-item__deadline">
                  До 2 октября{" "}
                </span>
              </div>
              <p className="actions-grid-item__info">
                Яндекс 360 — скидка до 70% на подписку для новых клиентов!
              </p>
              <button
                className="actions-grid-item__button"
                data-toggle-popup={941992}
                onClick="ym(,'reachGoal', '10269');"
              >
                Узнать больше
              </button>
            </div>
          </div>
        </div>
      </div>
    </div>
    <footer className="actions-footer">
      <div className="actions-footer__row actions-footer__row--first">
        <div className="actions-footer-message">
          <div className="actions-footer-message__text actions-footer-message__text--left">
            <p>А ещё есть акции?</p>
          </div>
          <div className="actions-footer-message__userpic">
            <svg width={24} height={24}>
              <use href="#icon-user" />
            </svg>
          </div>
        </div>
      </div>
      <div className="actions-footer__row actions-footer__row--last">
        <div className="actions-footer-message">
          <div
            className="actions-footer-message__userpic"
            style={{
              backgroundImage:
                "url(/files/logo/logo_3fca28708d6747d60f1d72dcb370803d.jpg)"
            }}
          />
          <div className="actions-footer-message__text actions-footer-message__text--right">
            <h4>Актуальные промокоды скидки купоны акции 2023</h4>
            <p>Больше акций и предложений в моих соцсетях</p>
            <div className="actions-footer-socials">
              <a
                className="actions-footer-socials__link"
                href="https://t.me/Blackfive50"
                target="_blank"
                onClick="ym(93807298,'reachGoal','telegram');"
              >
                <svg width={24} height={24}>
                  <use href="#icon-social-telegram" />
                </svg>
              </a>
            </div>
          </div>
        </div>
      </div>
    </footer>
  </div>
</>

  )
}

export default All